{"site":{"posts":[{"draft":false,"categories":[],"layout":"post","date":"2020-04-14 00:00:00 -0500","title":"Wittgenstein: Finding the Meaning of a Word","description":"A brief overview of the Socratic method and Wittgenstein’s philosophy of language to define words.","tags":["philosophy","language"],"image":"/images/socrates.jpg","slug":"wittgenstein","ext":".markdown","excerpt":"<p><em>A brief overview of the Socratic method and Wittgenstein’s philosophy of language to define words.</em></p>\n","content":"<p><em>A brief overview of the Socratic method and Wittgenstein’s philosophy of language to define words.</em></p>\n\n<p>In the Socratic dialogues, Socrates asks many times <em>“What is X?”</em>. X being courage, piety, justice, temperance or wisdom. The protagonists give him instances of these abstracts words as they try to come up with a definition. But Socrates rejects all of them; he always finds a use of the word which does not fit the given definition.</p>\n\n<p>In Euthyphro, for instance, Socrates and Euthyphro attempt to establish a definitive meaning for the word piety. Socrates asks: <em>“What is piety?”</em>, to which Euthyphro replies that piety is what he is doing right now. Socrates rejects this definition, because Euthyphro’s action is merely an example and does not provide the essential characteristic that make pious actions pious. Euthyphro attempts to give four further definitions, but Socrates keeps questioning them (known as the <strong>Socratic questioning</strong> or <strong>Socratic method</strong>). Euthyphro ends up running out of patience and leaves Socrates without a clear definition of piety.</p>\n\n<p><img src=\"https://miro.medium.com/max/1200/0*JvZwMoSu7ABRDgQU\" alt=\"Euthyphro\" /></p>\n\n<p>Socrates was seeking a common nature amongst the instances given to him to find a real definition. He believed the common nature justified the use of the common name, that it was unethical to use words if their meaning wasn’t truly known. For instance, one could only be just if one knew the underlying common nature in justice. But neither Socrates nor any of the protagonists of the Socratic dialogues ever manage to find true definitions. The unfinished work suggested philosophy still had much progress to make. In any case, Socrates believed that being aware of his ignorance made him wiser than those who, though ignorant, still claimed knowledge.</p>\n\n<blockquote>\n  <p>“I know that I know nothing.”</p>\n\n  <p>the Socratic paradox</p>\n</blockquote>\n\n<p>Centuries later, Ludwig Wittgenstein would attempt to resume Socrates’ unfinished work. He believed, however, that the people’s approach to give instances of words was right.</p>\n\n<blockquote>\n  <p>“I can characterize my standpoint no better than by saying that it is the antithetical standpoint to the one occupied by Socrates in the Platonic dialogues. For if I were asked what knowledge is, I would enumerate instances of knowledge and add the words ‘and similar things’. There is no shared constituent to be discovered since none exists.”</p>\n\n  <p>Voices of Wittgenstein, Waismann &amp; Wittgenstein, 2003, p. 33</p>\n</blockquote>\n\n<p><img src=\"https://miro.medium.com/max/800/0*z-u5VJtjCSKd2xiL.webp\" alt=\"Wittgenstein\" /></p>\n\n<p>In Philosophical Investigations, he considers instances of the word game to illustrate his point.</p>\n\n<blockquote>\n  <p>“Consider for example the proceedings that we call “games”. I mean board-games, card-games, ball-games, Olympic games, and so on. What is common to them all? Don’t say: “There must be something common, or they would not be called ‘games’” — but look and see whether there is anything common to all. — For if you look at them you will not see something that is common to all, but similarities, relationships, and a whole series of them at that. To repeat: don’t think, but look!”</p>\n\n  <p>Philosophical Investigations, Wittgenstein, 1953, p. 31</p>\n</blockquote>\n\n<p>Wittgenstein suggests to look instead of to think, and to describe instead of to explain. Thinking is an abstract process subject to the mind’s corrupted point of view, while looking is practical and avoids this bias. Wittgenstein argued that things, which could be thought to be connected by one essential common feature, may in fact be connected by a series of overlapping similarities, where no one feature is common to all of the things. He coined this concept <strong>family resemblance</strong>.</p>\n\n<blockquote>\n  <p>I can think of no better expression to characterize these similarities than “family resemblances”;… And I shall say: ‘games’ form a family.</p>\n</blockquote>\n\n<blockquote>\n  <p>Philosophical Investigations, Wittgenstein, 1953, p. 32</p>\n</blockquote>\n\n<p>Wittgenstein didn’t think that words corresponded to things. The function and the meaning of a word were determined by its use. Definition is not something prior to the use of a word that fixes its meaning and determines how it will be used, but rather a descriptive tool that reflects the various ways a word is used:</p>\n\n<blockquote>\n  <p>“Think of the tools in a tool-box: there is a hammer, pliers, a saw, a screwdriver, a rule, a glue-pot, nails and screws. — The functions of words are as diverse as the functions of these objects.”</p>\n\n  <p>Philosophical Investigations, Wittgenstein, 1953, p. 6</p>\n</blockquote>\n\n<p>Wittgenstein saw language merely as a tool used to accomplish everyday goals and activities, which essentially determine a word’s meaning. He called these activities <strong>language-games</strong>, because the rules of language were like the rules of a game, and saying something was like making a move in a game.</p>\n\n<blockquote>\n  <p>“Here the term “language-game” is meant to bring into prominence the fact that the speaking of language is part of an activity, or of a form of life.”</p>\n\n  <p>Philosophical Investigations, Wittgenstein, 1953, p. 11</p>\n</blockquote>\n\n<p>While our brains naturally associate pictures to words, even when thinking of abstract ones like justice or soul, words in reality don’t tell us anything about the true nature of the thing they represent. Wittgenstein’s main point was to escape from our mental images when dealing with philosophy because everyone had a different image that clouds reality.</p>\n\n<blockquote>\n  <p>“A picture held us captive. And we could not get outside it, for it lay in our language and language seemed to repeat it to us inexorably.”</p>\n\n  <p>Philosophical Investigations, Wittgenstein, 1953, p. 48</p>\n</blockquote>\n\n<p>On the other hand, even if one could find an essential definition of a word, this would not undermine Wittgenstein’s argument. Wittgenstein isn’t necessarily against definitions, because in many cases essential definitions do exist and are even needed, typically in scientific contexts. But he just does not think all words must have an essential definition, so he suggests the concept of family resemblance. This raises the question: <em>How can we know which terms have essential definitions and which do not?</em> Wittgenstein’s claim makes defining a concept easier by lowering the expectations of what is required, but the challenge is to remain precise.</p>\n\n<p>Wittgenstein valued clarity more than universal truth, which really made him stand out as a philosopher. Philosophers generally ask why to uncover hidden truths and consider that this is the most profound they can do. Wittgenstein, on the other hand, deemed looking as much profounder and saw it as a great difficulty because one must learn to ignore many preconceptions that cloud our judgment. Wittgenstein claiming that there is no shared constituent in knowledge would typically be reprimanded by most philosophers, particularly Socrates, because he gives up in the search for truth. While Wittgenstein does give valid answers to many of philosophy’s questions, he also inevitably raises further questions, like which terms have essential definitions and which do not. Much like in Socrates’ case, there is still work left to do in this regard. But in response to many of his critics, Wittgenstein would say:</p>\n\n<blockquote>\n  <p>“The mystical is not how the world is, but that it is.”</p>\n\n  <p>Wittgenstein, Tractatus Logico-Philosophicus, 1922</p>\n</blockquote>\n","url":"/blog/wittgenstein","relative_path":"_posts/2020-04-14-wittgenstein.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2021-01-28 00:00:00 -0600","title":"7 Lessons for Student-Entrepreneurs","description":"7 valuable lessons to help other student-entrepreneurs move forward with their goals and ambitions.","tags":["career","entrepreneurship"],"image":"/images/woods_antoinebruy.jpg","slug":"7-lessons","ext":".markdown","excerpt":"<p><em>This article is for student-entrepreneurs eager to getting their startup off-the-ground. I spent more than a year working on a startup project as a student at the Swiss Federal Institute of Technology in Lausanne (EPFL). I learned some valuable lessons that I hope can help other entrepreneurial-minded students move forward with their goals and ambitions.</em></p>\n","content":"<p><em>This article is for student-entrepreneurs eager to getting their startup off-the-ground. I spent more than a year working on a startup project as a student at the Swiss Federal Institute of Technology in Lausanne (EPFL). I learned some valuable lessons that I hope can help other entrepreneurial-minded students move forward with their goals and ambitions.</em></p>\n\n<p>Entrepreneurship always starts with an idea. But ideas don’t matter as much as we think initially. The sustained effort put in, the lessons from your journey, and ultimately, the lessons about you matter much more.</p>\n\n<p>Launching a startup is a major initiative. More so, if it involves refusing or quitting a job. When I was starting, I was focused on having my ideas come to fruition. I didn’t really know what I was getting myself into — thank goodness, because I wouldn’t have done it otherwise.</p>\n\n<p>Entrepreneurship is one hell of a ride. A startup is a lot more than just ideas. A clear vision is crucial, in order to recruit a diverse team of A-players. But only by constantly putting yourself on the frontline, taking on responsibilities and showing the way forward, do you fully gain your team’s trust and confidence.</p>\n\n<p>Here are some key lessons from my experience as a student-entrepreneur:</p>\n\n<h2 id=\"1-embrace-failure\">1. Embrace failure.</h2>\n<p>You’re going to fail. But it’s okay, because failing is part of life.</p>\n\n<p>Elon Musk, one of the greatest entrepreneurs of our generation, said he thought SpaceX and Tesla would fail, but he was perfectly okay with that. When people asked me about the risks of failure, I would say that if I failed, I would happily go live in nature.</p>\n\n<p>If you want to think like an entrepreneur, be prepared to fail. I came across a team of brilliant student-entrepreneurs who worked really hard on their project for far too long. They ended up disgusted by entrepreneurship when they decided to pull the plug. A shame, really, because startups are meant to be fun. Far too often, we hear epic stories of entrepreneurs who manage to pull out a win when things seem bleak, but we rarely hear about the countless others who don’t. When your startup has lost traction, admitting failure is probably one of the hardest but best things to do.</p>\n\n<p>Embrace failure. You will admit defeat more easily when your startup is sinking. More importantly: you will try more, you will learn more and you will achieve more.</p>\n\n<h2 id=\"2-communicate\">2. Communicate.</h2>\n<p>If you’re launching a startup, you want to spread the word out as much as possible because you never know who might provide you with crucial help down the road.</p>\n\n<p>When adding team members, be aware that your team’s success depends on good communication throughout your startup. Not only do additional team members create significant communication overhead (see Brook’s Law below), but they can also pose a risk if that person does not fit in with the culture of the startup.</p>\n\n<p>Brooks’ Law: a large team size represents significant overhead in terms of communication.</p>\n\n<p><img src=\"https://miro.medium.com/max/1400/1*pLdfse5oA5nJOEjemvmgig.webp\" alt=\"Communication lines\" /></p>\n\n<p>Treat your team like your family: you work for them, they don’t work for you. Be prepared to adapt to your team’s needs, and make sure that the people that you let in have both the capacity and the personality to work in a startup. One toxic person can be enough to ruin the fun. Losing team members is one of the worst things that can happen to a startup, because the workforce is so small.</p>\n\n<h2 id=\"3-dont-think-act\">3. Don’t think, act.</h2>\n<p>Overthinking is a classic time-wasting issue of inexperienced entrepreneurs. Avoid analysis paralysis by simplifying matters at hand. In this sense, recognising one-way and two-way door decisions can help.</p>\n\n<p>One-way door decisions are decisions that you can’t easily reverse. These need to be done methodically, carefully, slowly, with great deliberation and consultation. Two-way door decisions, on the other hand, can be reversed. You can walk through the door, see if you like it, and if not go back. These decisions should be automated or delegated. Most decisions are two-way door decisions, so learn to make these as quickly as possible.</p>\n\n<p>Overall, seek to develop habits that allow you to act and reflect effectively, while getting rid of bad ones too. Learn to say no, in order to focus on what you say yes to.</p>\n\n<h2 id=\"4-listen-carefully\">4. Listen carefully.</h2>\n<p>Just because you’re leading a startup, that doesn’t mean you’re always right.</p>\n\n<p>Listen carefully to everyone around you: your team, your clients, your partners, your friends. Surround yourself with people who think differently. Encourage team members to generate and brainstorm new ideas. Cherish hearing things that make you feel uncomfortable.</p>\n\n<p>Talk to clients. Put yourself in other people’s shoes. Learn to think about what you’re not thinking about. The truth may hurt, but a lack of truth will hurt even more in the long run.</p>\n\n<p>Don’t fall in the trap of blindly following what other people say. Everyone likes to think they know a few things about business. Learn to notice people who speak out of vanity — they’re probably not the ones you should be following advice from or even arguing with. Read people from their emotions, rather than their words.</p>\n\n<p>In the end, you must form your own opinions. Use the collective brain power of people around you to do most of the thinking — you’re just orchestrating.</p>\n\n<h2 id=\"5-trust-yourself\">5. Trust yourself.</h2>\n<p>Seek steady progress, rather than unrealistic ambitious goals.</p>\n\n<p>There will always be things that you can’t control. When goals or expectations aren’t reached, keep an objective view to content yourself with steady progress. Don’t be too hard on yourself and on others — everyone is doing their best. Do it for long enough and eventually you will hit the lottery. Everyone gets lucky sometimes.</p>\n\n<p>The definition of success is also highly subjective. Ultimately, the only one who can judge whether you’re being successful or not, is you. Believe in yourself. You’re capable of being whoever you set yourself out to be. Dream. Have faith.</p>\n\n<p>Finally, leaders must have enough character to build trust. Without trust, you have no followers. Without followers, who do you lead? Start by trusting yourself. You will trust others more easily and others will trust you more too.</p>\n\n<h2 id=\"6-improve-your-relationships\">6. Improve your relationships.</h2>\n<p>Seek to improve your relationships, starting with the ones closest to you. When I started off my entrepreneurial journey, not only was I taking somewhat of a risk, I wanted to launch a cannabis startup. You can imagine that my parents weren’t totally up for it.</p>\n\n<p>The road of a startup is long, you need to rely on other people’s enthusiasm to keep going. Get family and friends on board with your vision. Not only will it provide you with precious moral support, but more people will want to help you.</p>\n\n<p>Entrepreneurship is like sports. When you lose, you have to be the first one back on your feet encouraging team members to continue, no matter how hard of a blow you may just have gone through. When things are bad, don’t give up. When things are great, be realistic.</p>\n\n<p>Improving all of your relationships will help you lead with more empathy and spread positivity in your startup. Everyone will enjoy the ride a lot more.</p>\n\n<h2 id=\"7-know-yourself\">7. Know yourself.</h2>\n<p>Some philosophical questions you should constantly ask yourself throughout your journey:</p>\n\n<p>Who are you?\nWhy do you do what you do?\nWhat’s the change that you would like to see in the world?\nPhilosophy acts like a moral compass. Inquiring into your understanding of reality, knowledge, and how you should live will provide you with principles that can help you never feel lost in life again.</p>\n\n<blockquote>\n  <p>“Science is what you know. Philosophy is what you don’t know.”</p>\n\n  <p>Bertrand Russell</p>\n</blockquote>\n\n<p>Regularly put time aside to relax and reflect. Build your character. Remember, you’re playing the long game, so strive to stay healthy in the long run. Calming your mind down will boost your creativity. My best ideas come while relaxing, not when I am desperately looking for them.</p>\n\n<h2 id=\"final-thoughts\">Final thoughts</h2>\n<p>To summarise, focus on yourself and the rest will follow. Sometimes you may have to be patient, but hard work pays off.</p>\n\n<p>Many of the lessons that I learned, as well as several habits that I adopted, were inspired by Stoicism. Stoic principles provide useful and practical ways to find tranquility and improve one’s strengths of character. Some of the greatest leaders in history have followed Stoic philosophy.</p>\n\n<p>Nonetheless, theory is never enough. Practice is just as important, because in the words of a great Stoic philosopher:</p>\n\n<blockquote>\n  <p>“That’s why the philosophers warn us not to be satisfied with mere learning, but to add practice and then training. For as time passes, we forget what we learned and end up doing the opposite, and hold opinions the opposite of what we should.”</p>\n\n  <p>Epictetus</p>\n</blockquote>\n","url":"/blog/7-lessons","relative_path":"_posts/2021-01-28-7-lessons.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2021-09-15 00:00:00 -0500","title":"Fail fast, learn faster.","description":"After trying to launch a startup, I kneel down and surrender my sword to begin looking at new career opportunities.","tags":["career","entrepreneurship"],"image":"/images/knight_surrender.jpg","slug":"fail-fast-learn-faster","ext":".markdown","excerpt":"<p><em>Two years after taking the initiative of launching a startup, I kneel down and surrender my sword to begin looking at new career opportunities. The ride was crazy. Ecstatic moments repeatedly turned into emotional wreckages, only for new impulses to push me forward again. Despite the final outcome, the lessons were invaluable. Today, I feel more resilient than ever to face the next challenges that life will throw at me.</em></p>\n","content":"<p><em>Two years after taking the initiative of launching a startup, I kneel down and surrender my sword to begin looking at new career opportunities. The ride was crazy. Ecstatic moments repeatedly turned into emotional wreckages, only for new impulses to push me forward again. Despite the final outcome, the lessons were invaluable. Today, I feel more resilient than ever to face the next challenges that life will throw at me.</em></p>\n\n<p>While following my Master’s at EPFL, I realized how lucky I was to have a startup ecosystem that offered support to entrepreneurial students. University really seemed like the best time to launch a startup. It also motivated me for my studies: I didn’t simply want to get them over with anymore, I wanted to enjoy the experience and stick around a little longer.</p>\n\n<p>Naivety, curiosity and a strong desire to express my creativity pushed me toward entrepreneurship. The class of actions that followed made me grow in ways I couldn’t have possibly imagined. Taking on responsibilities, communicating regularly and trusting the right people were skills that I couldn’t have developed in a classroom or through a textbook. Had I known how difficult the entrepreneurial path would be, I would have never pursued it in the first place.</p>\n\n<p>I started brainstorming several ideas, but eventually settled for the Vivino of CBD. My dad was becoming quite a wine expert thanks to Vivino, while a friend was set to start a job at a CBD business. I tried CBD for sleep, stress, muscle pain and even as part of my spiritual practices. I discovered how much science there was to the cannabis plant, but how little was being presented to the public.</p>\n\n<p style=\"text-align:center;\"><img src=\"https://miro.medium.com/max/1400/0*RapTk4VMeNkn3yNC\" alt=\"CBD\" /></p>\n\n<p>University peers recommended me a startup course given by the Swiss Innovation Agency. Participants had to pitch their idea hoping to work on it throughout the course. Selected projects would have the opportunity to recruit team members and have coaches regularly provide them feedback. One of which would become my mentor and business partner: Haider Alleg.</p>\n\n<p>But things could have gone very differently from the start. Haider missed the round of introduction between the coaches and the startups. A couple of weeks later, I received a long thread of emails between Haider and another coach. Haider had been trying to reach me, but the messages had ended up in the wrong mailbox.</p>\n\n<p>When we finally managed to schedule our first in-person meeting, he came over an hour late. I entered our meeting annoyed, but came out amazed by the momentum he was already giving us. He sent me a duplicate of his Wordpress website for a similar project, which he had invested time and money in. It needed some tweaking, but within a week we could have our minimum viable product.</p>\n\n<p>Unfortunately, the excitement didn’t last. Coursework, project deadlines and final year exams were taking more time than expected. On top of that, my team wasn’t helping as much as I would have hoped for. I felt overwhelmed.</p>\n\n<p>Nonetheless, Haider’s input kept us going. His advice was so valuable that sometimes it took me months to realize things he had been saying all along. When the course came to an end, my teammates left the project. Haider couldn’t imagine me going forward with no team and no money.</p>\n\n<p>Still, I didn’t feel like it was time to give up just yet. I started reaching out to friends I thought might be interested by the project. Once I had recruited my first couple of team members, the tables turned: people were coming to me to offer help. We entered our best-ever-yet honeymoon phase. Launching a startup was fun!</p>\n\n<p>Everything was hugs and kisses until one day, my friend who wrote blog articles told me that he was quitting. I was devastated, but wasted little time in looking for new potential recruits.</p>\n\n<p>I was discussing terms with a new co-founder, when Haider called. He had a new project for me. His friend had developed an agricultural commodity trading platform, and was looking to deploy it in new industries such as cannabis. At first, I was hesitant. How could I let go of everything achieved in the past year. After seeing the platform, it became clearer that this project required my full uncontested attention.</p>\n\n<p>I called the previous project off and started dedicating myself to the new one. We had meetings every week. I was the most junior of the three, so every meeting was incredibly stimulating— I was learning so much!</p>\n\n<p>Fast-forward to 10 months later, and a mix of circumstances — including a lack of experience on my side — made us lose traction. Team dynamics weren’t on track anymore and eventually, we agreed that the best solution was to part ways.</p>\n\n<p>Weirdly enough, pulling the plug the second time was far easier than the first. I was happy to notice a reduction in the half-life of my emotions, key to move on in life.</p>\n\n<p>I feel extremely fortunate to have had an experience that I will carry on learning from for years to come. A massive thank you goes to everyone that I met along the way. Especially my parents for their unconditional support. None of this would have been possible without them.</p>\n\n<p>And remember: <em>fail fast, learn faster.</em></p>\n","url":"/blog/fail-fast-learn-faster","relative_path":"_posts/2021-09-15-fail-fast-learn-faster.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2023-03-01 00:00:00 -0600","title":"Finding my path","image":"/images/path.jpg","description":"Hold on tight, because life is a rollercoaster. Try to enjoy the ride though, it’s actually pretty fun!","tags":["career","consulting"],"slug":"finding-my-path","ext":".markdown","excerpt":"<p><em>TLDR; Hold on tight, because life is a rollercoaster. Try to enjoy the ride though, it’s actually pretty fun!</em></p>\n","content":"<p><em>TLDR; Hold on tight, because life is a rollercoaster. Try to enjoy the ride though, it’s actually pretty fun!</em></p>\n\n<p>I began my career by getting fired from my own startup project. Far from discouraging me, it gave me strength and clarity to tackle new challenges.</p>\n\n<p>After a period of burning cash, I needed to find a way to generate a steady income while gaining experience to launch my own business one day.</p>\n\n<p>Consulting seemed to respond best to those needs. My entourage, however, did not seem as enthusiastic:</p>\n\n<blockquote>\n  <p>“You don’t start a career in consulting.”</p>\n\n  <p>“Engineers who work in consulting waste their potential.”</p>\n\n  <p>“Consulting is hard work. Can you handle it?”</p>\n</blockquote>\n\n<p>Moreover, my initial consulting experience had been quite hectic, to say the least.</p>\n\n<p>After graduating from EPFL, my startup mentor hired me for a consulting gig. He, his client, and I met for a drink one afternoon to discuss a project. We established deadlines, defined a scope, and off I was to begin my summer project.</p>\n\n<p>A few weeks in, my mentor disappeared without any prior notice. He went on holiday and completely disconnected for nearly a month. Unexpectedly, I was left to handle the client on my own.</p>\n\n<p>The client was eager to disrupt the real estate industry with technology, while I was more focused on meeting expectations. I felt my job hanging by a thread, but I managed to deliver a report detailing realty pricing models that would be subsequently put to use.</p>\n\n<p>Weeks after getting that load off my back, my startup crashed. My last 2 years were gone in the blink of an eye. Fortunately, my university career fair was just around the corner. Out on the market with a failed startup story to tell, every company wanted to hire me.</p>\n\n<p>Skipping over several rounds of interviews, I joined Capgemini’s Insights and Data practice as a Data Analyst. A brand new team consisting of fresh consultants eager for success, led by a distinguished and experienced consultant. We were determined to attack the Swiss market, which was ripe for digitalization after the pandemic. On paper, the project seemed exciting, but in reality, it was destined for disaster. I wasn’t enjoying my experience there, so I left soon after.</p>\n\n<p>During the career fair, I was also in touch with Open Web Technology, a smaller yet reputable consulting firm. Although my head led me towards Capgemini, my heart always pumped for Open Web. The on-site interview had left a great impression on me: they were a small family of entrepreneurs sharing a similar background to mine. After leaving Capgemini, I knew where I wanted to be.</p>\n\n<p>The job did not disappoint. A few months in, I truly believed that I had found my dream job. I was learning a great deal, team events were fun, and, unlike before, my voice was heard.</p>\n\n<p>Naturally, I began taking on more and more responsibilities. With the onset of cold winter days, however, I started feeling overwhelmed. “Had I taken on too much too quickly?” I wondered. Everything was happening so fast, I had no time to pause and reflect. As we were delivering my biggest project yet, I took some time off and realized that the company and I were no longer aligned. I wasn’t growing the way I wanted to, so I quit shortly thereafter.</p>\n\n<p>Nonetheless, I learned some important lessons from my experiences:</p>\n\n<ul>\n  <li>A larger company does not necessarily mean it is better for you. As companies grow, they become less prone to taking risks. Their focus shifts toward maintaining profits and market share. Ideally, you should find a company that you can grow with.</li>\n  <li>My generation is used to quick wins and quick rewards (thank you smartphones). When we don’t receive them promptly, we become disappointed. This is important to keep in mind because building trust takes time. Based on my experiences, it takes even longer with older generations.</li>\n  <li>Going through several rounds of interviews is actually beneficial. You get to meet more people and get a better sense of the job. This will give you a better idea of what to expect once you start working.</li>\n  <li>When you start a new job, you’re not starting over — you’re starting from experience. Your experience is what sets you apart from everyone else.</li>\n</ul>\n\n<p>Life is a journey. The destination doesn’t matter as much as the experiences along the way. For me, that journey is only just beginning.</p>\n","url":"/blog/finding-my-path","relative_path":"_posts/2023-03-01-finding-my-path.markdown","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2024-03-27 00:00:00 -0500","title":"How Yoga Transformed Me","description":"Yoga has sparked a profound journey of self-discovery and healing for me; continually pushing boundaries and embracing new ways of living with an open heart and an eager spirit.","tags":["travel","life","story"],"image":"/images/ytt.jpg","slug":"yoga","ext":".markdown","excerpt":"<p><em>Feeling burned out from my last job and uncertain about my next steps, I decided to pursue a lifelong aspiration of mine: a Yoga Teacher Training. The training was nothing short of transformative: a profound journey of healing and growth unfolded. Since completing the training, my exploration of life’s vast possibilities has been ceaseless, continually pushing boundaries and embracing new ways of living with an open heart and an eager spirit.</em></p>\n","content":"<p><em>Feeling burned out from my last job and uncertain about my next steps, I decided to pursue a lifelong aspiration of mine: a Yoga Teacher Training. The training was nothing short of transformative: a profound journey of healing and growth unfolded. Since completing the training, my exploration of life’s vast possibilities has been ceaseless, continually pushing boundaries and embracing new ways of living with an open heart and an eager spirit.</em></p>\n\n<h2 id=\"yoga-and-i\">Yoga and I</h2>\n\n<p>My yogi journey began from being frustrated with experiencing intolerable pain in my body after intense physical exercise. Not only did I want to understand the cause of my discomfort, but I also wanted to explore gentler and more-attuned-to-my-body forms of exercising.</p>\n\n<p>Coincidentally, a friend who had been embracing the path of becoming a yoga instructor was inviting people to join her classes. I had been very much inspired by her journey, so I decided to go to my first class: a yin yoga session.</p>\n\n<p>Amidst a summer internship where stress was a constant companion, my first session offered me an unexpected reset; I awoke the next day completely disoriented, unsure of where I was or what day of the week it was. I felt deeply rested and completely rejuvenated.</p>\n\n<p>The impact of yoga was so profound that I was determined to continue practicing. But it wasn’t until the pandemic lockdown that it became an essential part of my life. Thanks to the Down Dog app, I started practicing yoga from home and tailoring sessions to my preferences. I could pick any body area to focus on and even pre-set the duration of each class. Yoga integrated smoothly into my daily routine.</p>\n\n<p>A few months into my yoga practice, its effects on my body became apparent. I ceased snoring, grew more reluctant to drink alcohol and more aware of the impact of different foods on my body. Over time, yoga enhanced many other aspects of my life such as my physical balance, mental focus, tolerance for pain, allergies, my ability to process emotions and adaptability to new environments. But most importantly, it broadened my mindset allowing me to experience and benefit from other disciplines as well.</p>\n\n<h2 id=\"stepping-into-a-yoga-teacher-training\">Stepping into a Yoga Teacher Training</h2>\n\n<p>Transitioning from university life and an entrepreneurial venture, I found myself navigating through various roles within the corporate world. After my last job, however, I felt disconnected and burned out. Amidst a period of uncertainty, pursuing a Yoga Teacher Training emerged as a hopeful beacon of clarity.</p>\n\n<p>My heart was set on Lake Atitlán in Guatemala — a place whose magical community had previously captivated me and promised the depth of immersion I yearned for. I considered various venues, eventually settling for the Mystical Yoga Farm as the place for my training. I had never been there, but I was ready to step beyond the familiar confines of my comfort zone.</p>\n\n<p>The farm turned out to offer a variety of activities that nurtured the mind, body and spirit. With yoga sessions, vibrant ecstatic dances, traditional temazcales and peaceful morning lake swims, this place was ideal to recover from life’s heavy upheavals. Beyond my yoga practice, I acquired numerous well-being techniques and practices that I still use today.</p>\n\n<p>The community was also special and played a crucial role in my recovery. Together with everyone at the farm, we cultivated a sanctuary of safety and freedom. The place became a space where every single one of us could freely express themselves and experience warm unconditional love and acceptance from the community. Through each practice, ceremony, and shared moment, my spirit was slowly infused with a profound sense of belonging and love.</p>\n\n<p><img src=\"/images/yoga_group.jpg\" alt=\"The Yoga Group\" /></p>\n\n<h2 id=\"studying-the-theory\">Studying the theory</h2>\n\n<p>Amidst the rich social encounters, my exploration into the origins and philosophy of yoga opened new horizons of understanding for me. I learned that yoga was meant to guide you towards enlightenment and help you navigate life’s inevitable sufferings with grace.</p>\n\n<p>Diving into the Yoga Sutras of Patañjali, one of the foundational texts of classical Yoga philosophy, I was introduced to the 8 limbs of yoga. This comprehensive framework provided me with invaluable insights and acted as a blueprint for a life of balance and harmony. The Yamas (ethical restraints) and the Niyamas (observances), for instance, resonated deeply with me. The Yamas taught me the significance of ethical conduct in interactions with the world, learning the importance of practicing non-violence, truthfulness, integrity, moderation, and non-attachment. Conversely, the Niyamas directed my focus inward, highlighting the importance of cleanliness, contentment, discipline, self-study, and surrender to a higher power, as pillars for personal growth and enlightenment.</p>\n\n<p>Our discussions also ventured into the realm of Karma, a concept that had captivated me upon reading Sadhguru’s book. These discussions shed light on the profound truth that each of our actions, thoughts and intentions set forth ripples in the Universe. Karma isn’t just about cause and effect though; it’s about performing actions with purity and without selfish desires, thereby cleansing our hearts and fostering spiritual growth. Understanding Karma as a form of selfless service instilled in me a commitment to live for the benefit of others, viewing such service not only as an act of devotion but as a pathway to authentic spirituality. This has become the cornerstone of my life’s purpose, guiding me to dedicate my life to serving others with an open heart.</p>\n\n<h2 id=\"stepping-out-of-the-community\">Stepping out of the community</h2>\n\n<p>Stepping out of this idyllic setting and back into the wider world, riddled with injustice and disconnection, was perhaps the hardest part. Suddenly, I found myself reminded of the pervasive materialism and disconnection that define much of modern society.</p>\n\n<p>I entered waves of depression due to a constant inner struggle that couldn’t accept me falling back into old habits and becoming my former self again. It felt as though I had evolved so much in just a few weeks, yet the world around me hadn’t changed a single bit.</p>\n\n<p>The expectation and pressure from my environment and relationships to behave exactly as I used to were suffocating. It took me months to integrate everything I had learned and to fully accept myself and my past again.</p>\n\n<p>The life I was leading, chasing after success and comfort as defined by society, was taking me further from my true self. Material possessions, job titles, and productivity no longer made sense to me. I realized I had been living a life filled with possessions but devoid of happiness, a life of conformity with little room for growth and authenticity. To find peace and purpose, I had to break away from these chains and wander away from the familiar to discover truths that society overlooks or deliberately ignores.</p>\n\n<p>Thankfully, this journey away from the conventional path led me to a community of like-minded souls, individuals who also sought meaning beyond the material, who valued the richness of experience over the accumulation of things. In this community, I found a deeper connection to the essence of life, a shared understanding that there is more to existence than what mainstream culture acknowledges.</p>\n\n<p>As I navigate a world overly characterized by its history, conservative values and an increasingly over-reliance on technology, the lessons learned through yoga and the principles of a more sustainable, human-centric approach to living have never been more relevant. Now, more than ever, it is imperative that we advocate for a society that values the human spirit and the planet over the relentless pursuit of technological advancement and economic growth.</p>\n\n<p>In closing, my journey through yoga has been much more than a path to personal growth; it has been a call to challenge the status quo, to seek a life that is rich in connection, authenticity, and purpose. It is a reminder that happiness and fulfilment lie not in what we own or achieve, but in how deeply we connect with ourselves, with others and ultimately, with our Universe. As I look forward, I hope to carry this wisdom with me and to spread it around me, forging a path that leads not only to individual well-being but to the healing of the world.</p>\n\n<p><img src=\"/images/sunset.jpeg\" alt=\"Sunset\" /></p>\n","url":"/blog/yoga","relative_path":"_posts/2024-03-27-yoga.markdown","permalink":null}],"pages":[{"draft":false,"categories":[],"layout":"default","title":"About Me","content_blocks":[{"_bookshop_name":"page-heading","title":"About Me","description":null},{"_bookshop_name":"page-image","image":"/images/ag-antigua-wall.jpg","image_alt":"Antigua Guatemala - my second home"},{"_bookshop_name":"content","content_html":"<p align=\"justify\">\n  <h2>My Background</h2>\n  <p align=\"justify\">\n  From the serene Swiss mountains to the colorful traditions of Guatemala, my upbringing wove together a diverse blend of cultures, values and ambitions, shaping both my personal and professional journey.\n  <br>\n  <br>\n  Raised by a dad who could speak binary if you asked nicely, and a mom who fought battles in every room like it was her daily workout, \n  my path was written in the stars before I even stepped onto the scene.\n  <br>\n  <br>\n  My academic interests led me to study at the Swiss Federal Institute of Technology Lausanne (EPFL), where I mastered the fine art of thriving on a potent mix of caffeine and adrenaline-fueled deadlines, while securing a Bachelor's degree in Communication Systems and a Master's in Data Science.\n  <br>\n  <br>\n</p>\n  <h2>My Professional Journey</h2>\n  <p align=\"justify\">\n  Rather than embracing the allure of distant shores, my summer breaks as a student were dedicated to mastering the ebb and flow of volatile energy prices.\n  Three consecutive summer internships at Koch Industries, allowed me to dive headfirst into the wild world of quantitative analysis and data science tools applied to energy commodity trading.\n  <br>\n  <br>\n  Nonetheless, I yearned for a more innovative path. The allure of doing something unique and pioneering motivated me to launch a cannabis startup in Switzerland.\n  I immersed myself in Switzerland's entrepreneurial ecosystem, expanding my network and familiarizing myself with the country's innovation landscape.\n  Starting a business here proved to be <a href=\"/blog/fail-fast-learn-faster\"> full of twists and turns</a>, much like navigating a mountain pass, but the exhilarating highs (no pun intended) undoubtedly made the journey worthwhile.\n  <br>\n  <br>\n  Eager to maintain my entrepreneurial momentum, I became part of Capgemini's latest initiative: the data squad. \n  I envisioned myself embarking on an adventure akin to a digital James Bond mission.\n  However, I soon realized that our \"super cool\" project was essentially becoming the janitors of the digital world, tasked with tidying up the chaotic data messes of mega-corporations in legacy software systems.\n  <br>\n  <br>\n  Craving a break from my role as the go-to tech minion for the corporate overlords, I wanted a taste of the business and strategy world. \n  That's when I stumbled into OWT, a place where Switzerland's finest entrepreneurs sharpened their pencils (and minds). \n  At OWT, I felt like I was living a dream, crafting exquisite products from mere thoughts to tangible triumphs.\n  I threw myself into the work with the passion of a love-struck teenager.\n  But like all whirlwind romances, I eventually hit the <a href=\"/blog/finding-my-path\">burnout wall</a>. \n  Torn to bits as if I had broken up with my highschool sweetheart, I left everything to travel around the world.\n  <br>\n  <br>\n</p>\n  <h2>Why Freelancing</h2>\n  <p align=\"justify\">\n    After a break from the complex landscapes of large corporations and institutions, I transitioned into freelancing with enthusiasm. \n    Embarking on this journey became necessary to embrace the freedom of achieving a harmonious balance across various facets of my life. \n    I found in freelancing not just unmatched flexibility but a profound opportunity to tackle diverse projects around the globe, each presenting its distinct objectives, resonating deeply with my personal identity and life's mission.\n    <br>\n    <br>\n    My data freelancing journey has allowed me to blend professional flexibility with personal development and cultural exchange. \n    Embracing diverse global projects enriches both my professional expertise and personal growth, creating a dynamic interplay between the work I do and the life I lead.\n    <br>\n    <br>\n    But my professional aspirations are just one facet of my freelancing journey. \n    Equally important is the freedom acquired to nurture other areas of my life, such as <a href=\"/blog/yoga\">practicing yoga</a> and exploring music. \n    These are not mere hobbies but essential components of my well-being and personal growth, enabling me to evolve in a more rounded and holistic manner.\n    <br>\n    <br>\n    Moreover, my journey is deeply rooted in a commitment to fostering a sustainable future for our society and planet. \n    My endeavors, both personal and professional, are driven by a vision of achieving harmony between humanity and nature—a vision where this balance is not merely an aspiration but a tangible reality.\n</p> </p>"},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"adriguerra.us21.list-manage.com/subscribe/post?u=797ad5c238231ca5a3ca3478e&amp;id=3ef0806f26&amp;f_id=00fffbe6f0","newsletter_button":"Subscribe"}],"slug":"about","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/about/","relative_path":"_pages/about.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Blog","content_blocks":[{"_bookshop_name":"page-heading","title":"Blog","description":"A collection of stories, reflections, and experiences."},{"_bookshop_name":"posts-list","show_posts":true},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"adriguerra.us21.list-manage.com/subscribe/post?u=797ad5c238231ca5a3ca3478e&amp;id=3ef0806f26&amp;f_id=00fffbe6f0","newsletter_button":"Subscribe"}],"slug":"blog","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/blog/","relative_path":"_pages/blog.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Contact","content_blocks":[{"_bookshop_name":"contact-form","form_title":"Get in touch","form_description":"Reach out for any inquiries.","form_submission_email":"adrian.guerra@live.com","form_button_text":"Send now"}],"slug":"contact","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/contact/","relative_path":"_pages/contact.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Elements","content_blocks":[{"_bookshop_name":"page-heading","title":"Elements","description":null},{"_bookshop_name":"page-image","image":"/images/page-2.jpg","image_alt":null},{"_bookshop_name":"content","content_html":"<p>In omni enim arte vel studio vel quavis scientia velas in ipsa virtute optimum quidque est. Quod est, ut dixi, habere ea, quae secundum naturam sint, vel omnia vel plurima et maxima. Quodsi ipsam honestatem undique pertectam atque absolutam. Tecum optime, deindestum etiam cum mediocri amico. Neque enim disputari sine reprehensione nec cum iracundia aut pertinacia recte disputari potest. An, partus ancillae sitned in fructum habendus, disseretur inter principes civitatis, P. Ut in geometria, prima si dederis, danda sunt omnia. Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sintero conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles rarissimum servari tinere.</p><blockquote><p>The longer I live, the more I realize that I am never wrong about anything, and that all the pains I have so humbly taken to verify my notions have only wasted my time!</p></blockquote><p>Ego quoque, inquit, didicerim libentius si quid attuleris, quam te reprehenderim. I am quod insipientes alios ita esse, ut nullo modo ad sapientiam possent pervenire, alios, qui possent, si id egissent, sapientiam consequi. Id quaeris, inquam, in quo, utrum respondero, verses te huc atque illuc necesse est. Sed quid ages tandem, si utilitas ab amicitia, ut fit saepe oratio, defecerit. Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit. Quae quidem sapientes sequuntur duce natura tamquam videntes. Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu sit, id nihil ad nos pertinere omnino. Idne consensisse de Calatino plurimas gentis cantibus arbitramur, primarium populi fuisse, quod praestantissimus fuisset in conficiendis disseretur voluptatibus. Utram tandem linguam nescio. Quod dicit Epicurus voluptate terra perfectio.</p>"},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"elements","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/elements/","relative_path":"_pages/elements.html","permalink":null},{"draft":false,"categories":[],"layout":"default","permalink":"/","title":"Home","content_blocks":[{"_bookshop_name":"hero","title":"Hi there, I am Adrian Guerra","description_html":"<p><strong>Data Project Manager</strong> hailing from Geneva, Switzerland.\n  My portfolio showcases a blend of analytical expertise with creative problem-solving, dedicated to transforming data into impactful strategies and innovative solutions.","image":"/images/IMG_8447.jpg","image_alt":"Adrian Guerra's picture","cta_button":"Contact me","cta_button_link":"#contact","works_button":"See my works","works_button_link":"#projects"},{"_bookshop_name":"projects-section","title":"Latest Works","description_html":"","link_url":"/portfolio","show_projects":true},{"_bookshop_name":"testimonials-section","title":"What People Say","description_html":null,"show_testimonials":true},{"_bookshop_name":"blog-section","title":"Recent Posts","description_html":"","link_url":"/blog","show_posts":true},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"adriguerra.us21.list-manage.com/subscribe/post?u=797ad5c238231ca5a3ca3478e&amp;id=3ef0806f26&amp;f_id=00fffbe6f0","newsletter_button":"Subscribe"},{"_bookshop_name":"contact-form","form_title":"Get in touch","form_description":"Reach out for any inquiries.","form_submission_email":"adrian.guerra@live.com","form_button_text":"Send now"}],"slug":"index","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/","relative_path":"_pages/index.html"},{"draft":false,"categories":[],"layout":"default","title":"Portfolio","content_blocks":[{"_bookshop_name":"page-heading","title":"My Works","description":"My best works built with passion, simplicity, and creativity."},{"_bookshop_name":"projects-list","show_projects":true},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"adriguerra.us21.list-manage.com/subscribe/post?u=797ad5c238231ca5a3ca3478e&amp;id=3ef0806f26&amp;f_id=00fffbe6f0","newsletter_button":"Subscribe"}],"slug":"portfolio","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/portfolio/","relative_path":"_pages/portfolio.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Privacy Policy","content_blocks":[{"_bookshop_name":"page-heading","title":"Privacy Policy","description":null},{"_bookshop_name":"content","content_html":"<h1>Privacy Policy</h1> <p><strong>Effective Date:</strong> 22 May 2024</p>\n<h2>Your Privacy Matters</h2> <p>I am committed to protecting your privacy. This Privacy Policy outlines how I collect, use, and safeguard your personal information. By using my website, you agree to the terms outlined in this policy.</p>\n<h2>Information I Collect</h2> <p><strong>Email Addresses:</strong> When you provide your email address on my website, I collect this information to add to my Customer Relationship Management (CRM) system. This helps me manage and improve my interactions with you.</p>\n<h2>How I Use Your Information</h2> <ol>\n    <li><strong>Communication:</strong> To send you updates, newsletters, and information related to my services.</li>\n    <li><strong>Customer Relationship Management:</strong> To manage and enhance my relationship with you by keeping track of our interactions and providing better service.</li>\n</ol>\n<h2>Information Sharing and Disclosure</h2> <p>I respect your privacy and do not sell, trade, or otherwise transfer your personal information to outside parties. The email addresses collected are used solely for the purposes mentioned above and are not shared with third parties without your explicit consent, except as required by law.</p>\n<h2>Data Security</h2> <p>I implement a variety of security measures to maintain the safety of your personal information. Your data is stored in a secure CRM system, and I take reasonable precautions to protect it from unauthorized access, alteration, or disclosure.</p>\n<h2>Your Consent</h2> <p>By providing me with your email address, you consent to the collection and use of this information as described in this Privacy Policy.</p>\n<h2>Changes to My Privacy Policy</h2> <p>I may update this Privacy Policy from time to time. Any changes will be posted on this page with an updated effective date. I encourage you to review this policy periodically to stay informed about how I am protecting your information.</p>\n<h2>Contact Me</h2> <p>If you have any questions or concerns about this Privacy Policy or my data practices, please contact me using the contact form below.</p>\n<p>Thank you for trusting me with your personal information. I am committed to ensuring your privacy and providing a secure experience on my website.</p>"},{"_bookshop_name":"contact-form","form_title":"Get in touch","form_description":"Reach out for any inquiries.","form_submission_email":"adrian.guerra@live.com","form_button_text":"Send now"}],"slug":"privacy","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/privacy/","relative_path":"_pages/privacy.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Services","content_blocks":[{"_bookshop_name":"page-heading","title":"Services","description":null},{"_bookshop_name":"content","content_html":"<h2>Web development</h2> <p>Creating responsive, user-friendly websites tailored to meet your business needs. From design to deployment, I ensure your online presence is impactful and engaging.</p>\n<h2>Data Analysis & Interpretation</h2> <p>Transforming complex datasets into actionable insights. By analyzing trends and patterns, I help you make data-driven decisions to propel your business forward.</p>\n<h2>Custom Machine Learning Solutions</h2> <p>Building and deploying models tailored to your specific needs. Leveraging advanced algorithms, I create models that predict outcomes and automate processes.</p>\n<h2>Data Visualization</h2> <p>Crafting clear visual representations of data for informed decision-making. Using tools like PowerBI, I design dashboards and visualizations that make complex data easy to understand.</p>\n<h2>Business Analysis</h2> <p>Evaluate and optimize operational processes and systems to drive strategic business decisions and improvements. I provide insights that help streamline operations and enhance efficiency.</p>\n<h2>IT Project Management</h2> <p>Managing bespoke IT projects from conception to delivery. I ensure projects are completed on time, within scope, and aligned with business goals.</p>"},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"services","ext":".html","tags":[],"excerpt":"","date":"2024-07-14 16:06:06 -0500","content":"","url":"/services/","relative_path":"_pages/services.html","permalink":null}],"projects":[{"draft":false,"categories":[],"layout":"project","date":"2018-07-01 00:00:00 -0500","title":"Enhancing Data Acquisition for Energy Market Through Advanced Web Scraping Solutions","subtitle":"Software Development","image":"/images/electricity.jpg","slug":"webscrape","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p>In the dynamic and data-intensive energy trading sector, the need for real-time, accurate supply and demand data is paramount. Traders and investors were struggling with outdated and unreliable data sources, impeding their ability to make swift and informed market decisions. Additionally, the lack of a robust, efficient HTML parser tailored to .NET frameworks further complicated the data extraction process from complex web structures.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p>In the dynamic and data-intensive energy trading sector, the need for real-time, accurate supply and demand data is paramount. Traders and investors were struggling with outdated and unreliable data sources, impeding their ability to make swift and informed market decisions. Additionally, the lack of a robust, efficient HTML parser tailored to .NET frameworks further complicated the data extraction process from complex web structures.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>Developed a comprehensive suite of solutions to address the core issues faced by traders and investors. The project involved three major components:</p>\n\n<ol>\n  <li>\n    <p><strong>Web Scraping Programs:</strong> Implemented advanced web scraping programs using LINQ, specifically designed to extract vital supply and demand data from various energy operators’ websites. These programs were capable of navigating and parsing complex web structures to retrieve up-to-date and accurate market data.</p>\n  </li>\n  <li>\n    <p><strong>HTML5 Parser .NET Standard Library:</strong> Developed a custom HTML5 parser .NET Standard library, modeled after an existing JavaScript parser, to serve as a cornerstone for future web scraping endeavors. This parser was crafted to integrate seamlessly with .NET frameworks, ensuring high performance and reliability in data extraction tasks.</p>\n  </li>\n  <li>\n    <p><strong>Library Unit Testing:</strong> Rigorously unit-tested the web scraping library using NUnit to ensure the reliability, performance, and accuracy of the scraping tools. This testing phase was crucial in identifying and addressing potential issues, paving the way for a robust and fault-tolerant solution.</p>\n  </li>\n</ol>\n\n<h3 id=\"tools-used\">Tools Used:</h3>\n\n<ul>\n  <li><strong>WebLINQ</strong>: The core library developed for streamlined and efficient web scraping.</li>\n  <li><strong>LINQ</strong>: Utilized for querying data within the web scraping programs, offering clear and concise syntax.</li>\n  <li><strong>.NET Standard Library &amp; C#</strong>: Chosen for the development of the HTML5 parser, ensuring optimal performance and integration with the WebLINQ library.</li>\n  <li><strong>NUnit</strong>: Employed for meticulous unit testing of the library, ensuring the reliability and accuracy of the scraping tools.</li>\n</ul>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The project successfully revolutionized the data acquisition process for traders and investors in the energy market. The tailored web scraping programs provided real-time, accurate market data, significantly enhancing market prediction models and investment strategies. The custom HTML5 parser further streamlined the data extraction process, offering high performance and seamless integration with .NET frameworks. The rigorous unit testing ensured the reliability and robustness of the solution, instilling confidence in its performance and accuracy. Overall, the project marked a significant advancement in data-driven decision-making within the energy trading sector.</p>\n","url":"/portfolio/webscrape","relative_path":"_projects/2018-07-01-webscrape.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2019-06-01 00:00:00 -0500","title":"Automatic Detection of Rooftop Solar Panels using Convolutional Neural Networks","subtitle":"Deep Learning","image":"/images/deepsolar_getty-960x540.jpg","slug":"rooftop-solar-panels","ext":".md","tags":[],"excerpt":"<p><strong><em>Note:</em></strong>\n<em>This project culminated in the publication of an academic paper, detailing our methodology, findings, and implications for the broader field of distributed energy infrastructure and urban planning. The paper, titled “Automatic Detection of Rooftop Solar Panels using Convolutional Neural Networks,” and co-authored along with Roberto Castello, Simon Roquette, Martin Esguerra and Jean-Louis Scartezzini, is accessible at the following <a href=\"https://iopscience.iop.org/article/10.1088/1742-6596/1343/1/012034\">link.</a></em></p>\n","content":"<p><strong><em>Note:</em></strong>\n<em>This project culminated in the publication of an academic paper, detailing our methodology, findings, and implications for the broader field of distributed energy infrastructure and urban planning. The paper, titled “Automatic Detection of Rooftop Solar Panels using Convolutional Neural Networks,” and co-authored along with Roberto Castello, Simon Roquette, Martin Esguerra and Jean-Louis Scartezzini, is accessible at the following <a href=\"https://iopscience.iop.org/article/10.1088/1742-6596/1343/1/012034\">link.</a></em></p>\n\n<h3 id=\"problem\">Problem</h3>\n<p>Accurately mapping the location and size of solar installations in urban areas presents a significant challenge yet is crucial for policymakers and investors in distributed energy infrastructures. Traditional methods, such as surveys and database analysis, are often limited in scope and scalability, leading to a gap in comprehensive, large-scale mapping of solar installations. This gap hinders effective policy-making and investment in solar technology.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>This project addresses the challenge by applying a supervised machine learning approach, specifically convolutional neural networks (CNNs), for the pixel-wise image segmentation of rooftop solar panels. By utilizing high-resolution aerial photos provided by the Swiss Federal Office of Topography, the project enables precise delineation and size detection of rooftop solar installations. The approach involves:</p>\n\n<ol>\n  <li>\n    <p><strong>Data Augmentation and Parameter Tuning</strong>: Implementing various data augmentation techniques and adjusting network parameters to optimize model performance, ensuring the model’s robustness and accuracy in different urban scenarios.</p>\n  </li>\n  <li>\n    <p><strong>Pixel-wise Image Segmentation</strong>: Employing CNNs for pixel-wise segmentation, the model accurately identifies and delineates individual solar panels on rooftops, providing detailed insights into their distribution and size.</p>\n  </li>\n  <li>\n    <p><strong>Scalability and National Scale Prediction</strong>: Demonstrating the scalability of the trained model by predicting the deployment of solar panels at a national level, specifically across Switzerland, showcasing the model’s applicability for large-scale analysis.</p>\n  </li>\n  <li>\n    <p><strong>Correlation Analysis with Environmental and Socio-economic Variables</strong>: Analyzing the correlation between solar panel deployment and local environmental and socio-economic factors, paving the way for predictive models that can foster the future adoption of solar technology in urban areas.</p>\n  </li>\n</ol>\n\n<h3 id=\"tools-used\">Tools Used</h3>\n<ol>\n  <li>\n    <p><strong>Python Deep Learning Libraries</strong>: Utilizing popular Python libraries such as PyTorch, Keras, and TensorFlow to build, train, and validate the convolutional neural networks, ensuring the use of cutting-edge techniques in deep learning.</p>\n  </li>\n  <li>\n    <p><strong>High-Resolution Aerial Photos</strong>: Leveraging high-quality aerial imagery provided by the Swiss Federal Office of Topography as the primary data source for the model, ensuring accurate and high-fidelity input data for analysis.</p>\n  </li>\n</ol>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The project successfully developed a machine learning model capable of accurately detecting and delineating rooftop solar panels in urban areas with a high degree of precision (accuracy of about 0.94 and an Intersection over Union index of up to 0.64). The scalability of the model enables the prediction of solar panel deployment on a national scale, offering valuable insights for policymakers and investors. Furthermore, the correlation of solar installation data with local environmental and socio-economic variables opens avenues for predictive analytics, supporting the strategic expansion of solar technology in urban landscapes.</p>\n","url":"/portfolio/rooftop-solar-panels","relative_path":"_projects/2019-06-01-rooftop-solar-panels.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2019-07-01 00:00:00 -0500","title":"Predictive Modeling of Oil Flows on Seaway Pipeline for Strategic Trading","subtitle":"Machine Learning","image":"/images/pipeline_582x327.png","slug":"seaway","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p>In the volatile oil trading market, predicting the volume of oil flow through pipelines like the Seaway is critical for traders to make informed decisions. An oil trader of a major company was seeking a reliable predictive solution that could anticipate the monthly oil flow based on the arbitrage fluctuations from the previous month. This task posed significant challenges due to the complexity of the factors influencing oil flows, including market volatility and economic indicators.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p>In the volatile oil trading market, predicting the volume of oil flow through pipelines like the Seaway is critical for traders to make informed decisions. An oil trader of a major company was seeking a reliable predictive solution that could anticipate the monthly oil flow based on the arbitrage fluctuations from the previous month. This task posed significant challenges due to the complexity of the factors influencing oil flows, including market volatility and economic indicators.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>The project developed a sophisticated machine learning algorithm tailored for the oil trader’s need to forecast the monthly oil flow in the Seaway pipeline. The approach involved:</p>\n\n<ol>\n  <li>\n    <p><strong>Data Analysis and Preprocessing</strong>: Analyzed historical data of oil flows and corresponding arbitrage fluctuations to identify patterns, correlations and relevant features crucial for the prediction model.</p>\n  </li>\n  <li>\n    <p><strong>Regression Techniques</strong>: Implemented regression techniques, including linear regression, lasso regression, and ridge regression, to develop a robust predictive model. These techniques were instrumental in understanding and modeling the relationship between arbitrage fluctuations and subsequent oil flows.</p>\n  </li>\n  <li>\n    <p><strong>Dimensionality Reduction</strong>: Employed Principal Component Analysis (PCA) to refine the model further by reducing the dimensionality of the dataset. This step enhanced the model’s performance by focusing on the most relevant features and eliminated noise.</p>\n  </li>\n</ol>\n\n<h4 id=\"tools-used\">Tools Used:</h4>\n<ol>\n  <li>\n    <p><strong>Data Preprocessing and Analysis</strong>: Python library pandas was used for data cleaning, transformation, and exploratory data analysis. This helped identify critical trends and correlations that would inform the predictive model.</p>\n  </li>\n  <li>\n    <p><strong>Machine Learning Libraries</strong>: Leveraged scikit-learn to implement and fine-tune the regression models and PCA, ensuring efficient and reliable algorithms for predictive tasks.</p>\n  </li>\n  <li>\n    <p><strong>Data Visualization</strong>: Matplotlib was employed for data visualization, providing insightful visualizations of trends, patterns, and model performance that supported comprehensive understanding.</p>\n  </li>\n</ol>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The predictive model achieved an impressive accuracy of 96% on historical data, significantly enhancing the oil trader’s capability to forecast monthly oil flows through the Seaway pipeline based on previous month’s arbitrage fluctuations. This high level of accuracy in prediction allowed the trader to make strategic decisions, optimize trading strategies, and mitigate risks associated with the volatile oil market. The success of this project demonstrates the power of machine learning in transforming data into actionable insights in the complex domain of oil trading.</p>\n","url":"/portfolio/seaway","relative_path":"_projects/2019-01-12-seaway.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2019-07-01 00:00:00 -0500","title":"Data Visualization of Trend-Following Participants in Petroleum Market","subtitle":"Data Visualization","image":"/images/trading-data-viz.jpg","slug":"powerbi","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p>The oil team of major trading company faced the challenge of monitoring the positions of trend-following participants, such as hedge funds and large speculators, whose behaviors significantly influence market dynamics. The task was complicated by the vast amounts of data and the intricacy of market movements, leading to difficulties in identifying and analyzing trends. This complexity risked oversights and misinformed decisions, underscoring the need for a solution that could seamlessly integrate into their daily operations and provide clear insights into these market influencers.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p>The oil team of major trading company faced the challenge of monitoring the positions of trend-following participants, such as hedge funds and large speculators, whose behaviors significantly influence market dynamics. The task was complicated by the vast amounts of data and the intricacy of market movements, leading to difficulties in identifying and analyzing trends. This complexity risked oversights and misinformed decisions, underscoring the need for a solution that could seamlessly integrate into their daily operations and provide clear insights into these market influencers.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>To address this challenge, the project developed a comprehensive data dashboard utilizing Power BI, designed to visualize the positions and activities of trend-following participants in the petroleum market. This innovative solution was crafted to offer a clear, interactive, and real-time visual representation of market data, aiding stakeholders in making informed decisions. By illustrating market sentiments and the potential impact of trend-following participants on price movements and trends, the dashboard serves as a pivotal tool in understanding and navigating the market’s complexities.</p>\n\n<h3 id=\"tools-used\">Tools Used:</h3>\n<ul>\n  <li><strong>Power BI</strong>: Chosen for its powerful data modeling, advanced analytics, and rich visualization capabilities, Power BI serves as the backbone of the dashboard, transforming complex datasets into insightful, interactive visual reports.</li>\n  <li><strong>Data Sources</strong>: The dashboard leverages authoritative, real-time data from major stock exchanges, including trading volumes and positions data of trend-following participants, ensuring the information displayed is both relevant and current.</li>\n  <li><strong>Custom Visuals and Analytics Features</strong>: The dashboard incorporates custom visuals such as trend lines, heat maps, and volume charts, tailored to highlight the activities of trend-following participants. Power BI’s advanced analytics features, like quick insights and drill-down capabilities, empower users to explore and uncover intricate market trends and patterns.</li>\n</ul>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The implementation of the Power BI dashboard directly into the chat group/channel of the oil trading team enabled daily visualization of trend-following participants’ positions. This integration significantly enhanced the team’s ability to quickly and accurately assess market conditions, facilitating more informed decision-making. By providing a clear and concise overview of market influencers’ behaviors, the dashboard has become an indispensable tool in the team’s daily operations, helping to mitigate risks associated with market volatility and ensuring a strategic edge in the highly competitive petroleum market.</p>\n","url":"/portfolio/powerbi","relative_path":"_projects/2019-01-15-powerbi.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-03-01 00:00:00 -0600","title":"Social Sentiment Analysis of CBD Consumption","subtitle":"Natural Language Processing","image":"/images/hemp-oil.jpg","slug":"CBD","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p>Despite the rising popularity of Cannabidiol (CBD) products, there is a lack of conclusive scientific evidence regarding its health benefits. Online communities are burgeoning with discussions about CBD, its uses, effects, and health benefits, making them a rich source of unstructured data. However, there is a significant gap in systematically analyzing this wealth of information to understand public sentiment and the prevalent uses of CBD at an epidemiological scale.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p>Despite the rising popularity of Cannabidiol (CBD) products, there is a lack of conclusive scientific evidence regarding its health benefits. Online communities are burgeoning with discussions about CBD, its uses, effects, and health benefits, making them a rich source of unstructured data. However, there is a significant gap in systematically analyzing this wealth of information to understand public sentiment and the prevalent uses of CBD at an epidemiological scale.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>The project aimed to harness the power of Natural Language Processing (NLP) to analyze discussions from online communities, specifically on the Reddit platform, where health benefits and effects of CBD are frequently discussed. The approach involved two key methodologies:</p>\n\n<ol>\n  <li>\n    <p><strong>Bio-medical Entity Recognition</strong>: This technique was applied to submissions from the Reddit communities to identify and categorize medical entities being discussed. This step was crucial for understanding the context and focus areas of the discussions, particularly related to medical terms and CBD usage.</p>\n  </li>\n  <li>\n    <p><strong>Aspect-based Sentiment Analysis</strong>: Utilizing a BERT-based sentiment analysis model, the project analyzed both submissions and comments to gauge public sentiment surrounding four aspects of CBD: effectiveness, side effects, dosage, and administration methods.</p>\n  </li>\n</ol>\n\n<h4 id=\"tools-used\">Tools Used:</h4>\n<ol>\n  <li>\n    <p><strong>BERT (Bidirectional Encoder Representations from Transformers)</strong>: Leveraged as a state-of-the-art NLP model for understanding the context of words in search queries and performing aspect-based sentiment analysis, providing nuanced insights into public sentiment towards CBD.</p>\n  </li>\n  <li>\n    <p><strong>Bio-medical Entity Recognition Tools</strong>: Employed specialized NLP tools designed for recognizing and categorizing medical entities within large text datasets, essential for filtering and interpreting the discussions accurately.</p>\n  </li>\n</ol>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The analysis revealed that CBD is predominantly used for managing mental health conditions, particularly anxiety disorders, with sublingual administration being the most popular method. The overall sentiment towards CBD on these online platforms is low, with slightly positive views on its effectiveness but mixed feelings regarding side effects and dosage. This project underscores the potential of advanced NLP methods in mining social media data to track public sentiment and usage patterns related to health products like CBD. It highlights the importance of social media surveillance as a fast, convenient, and cost-effective method to complement traditional surveillance sources. The findings also suggest a need for more research and better public health communication regarding the effects and potential benefits of CBD consumption.</p>\n","url":"/portfolio/cbd","relative_path":"_projects/2021-03-01-CBD.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2021-07-29 22:20:35 -0500","title":"Business Analysis for a Real Estate Price Prediction Application","subtitle":"Business Analysis","image":"/images/swiss_real_estate.jpg","slug":"ba-real-estate","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p>The real estate market in Switzerland is highly regulated and complex, making accurate property valuation challenging for real estate vendors. There was a need for an advanced solution that could automate the pricing process by encapsulating the deep market knowledge and pricing methodologies specific to the Swiss real estate market.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p>The real estate market in Switzerland is highly regulated and complex, making accurate property valuation challenging for real estate vendors. There was a need for an advanced solution that could automate the pricing process by encapsulating the deep market knowledge and pricing methodologies specific to the Swiss real estate market.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>Over two months, I collaborated closely with a renowned real estate expert to distill and document extensive knowledge and insights about property valuation in Switzerland. The solution involved the following key components:</p>\n\n<ol>\n  <li>\n    <p><strong>Knowledge Capture and Documentation</strong>: Conducting intensive sessions with the real estate expert to capture the nuanced understanding of property valuation, including market trends, regulatory impacts, and valuation methods specific to different types of properties in Switzerland. This involved establishing data dictionaries of both first and third-party data to ensure a comprehensive understanding of the datasets used in the valuation process.</p>\n  </li>\n  <li>\n    <p><strong>Development of Formulae and Algorithms</strong>: Synthesizing the expert knowledge into practical, actionable formulae, algorithms, and pricing methods tailored for each distinct type of real estate property in Switzerland. Algorithm specifications of pricing methods for Swiss realty properties were meticulously crafted to ensure accuracy and relevance. This step included data pipeline modelling with input/output layer streams to streamline the flow of data and optimize the valuation process.</p>\n  </li>\n  <li>\n    <p><strong>Collaboration with Developers</strong>: Providing the detailed report, including the pricing algorithms and methodologies, to the development team. This report served as the foundation for the creation of a sophisticated real estate marketing platform. Additionally, a draft technical requirements report was drafted to outline the specifications and functionalities required for the development of the platform, ensuring seamless integration of the pricing algorithms and methodologies.</p>\n  </li>\n</ol>\n\n<h3 id=\"tools-used\">Tools Used:</h3>\n<ol>\n  <li>\n    <p><strong>Business Analysis Tools</strong>: Utilized advanced business analysis tools and techniques for documenting the expert knowledge, developing pricing formulae, and ensuring the information was structured and accessible for the development team.</p>\n  </li>\n  <li>\n    <p><strong>Collaboration Platforms</strong>: Leveraged collaboration platforms to facilitate seamless communication and knowledge transfer between the real estate expert, the business analyst (myself), and the development team.</p>\n  </li>\n</ol>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The project successfully culminated in the creation of a comprehensive report that encapsulated the deep market knowledge and pricing methodologies for real estate properties in Switzerland. This report was instrumental in guiding the development of a cutting-edge real estate marketing platform. The platform is capable of automatically determining property prices, thereby empowering real estate vendors to accurately price and effectively market their properties to appropriate buyers, streamlining the real estate selling process in the Swiss market.</p>\n","url":"/portfolio/ba-real-estate","relative_path":"_projects/2021-07-30-ba-real-estate.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2022-01-14 22:20:35 -0600","title":"Automated Costs Allocation Based on Historical Inputs of Financial Controllers","subtitle":"Machine Learning","image":"/images/semiconductor.jpg","slug":"semiconductor","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p><a href=\"https://www.st.com/\">STMicroelectronics</a>, a prominent figure in the semiconductor industry, faced challenges in optimizing the cost allocation processes for wafer production and material costs. These costs are crucial in semiconductor manufacturing, and the existing manual methods were inefficient and prone to errors. The company needed a solution to accurately classify these costs into multiple categories, leveraging the vast amounts of historical financial controller data.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p><a href=\"https://www.st.com/\">STMicroelectronics</a>, a prominent figure in the semiconductor industry, faced challenges in optimizing the cost allocation processes for wafer production and material costs. These costs are crucial in semiconductor manufacturing, and the existing manual methods were inefficient and prone to errors. The company needed a solution to accurately classify these costs into multiple categories, leveraging the vast amounts of historical financial controller data.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>The solution was an advanced machine learning-based system designed to automate the cost allocation process. This system was developed to analyze financial controller data, specifically focusing on wafer production and material costs, and classify these costs accurately using a multi-class classification approach. The project involved a detailed analysis of the financial data, followed by the application of several machine learning techniques to find the most effective method for cost classification.</p>\n\n<h3 id=\"tools-used\">Tools Used</h3>\n<p>The project employed a variety of machine learning tools and techniques to achieve its objectives:</p>\n\n<ul>\n  <li><strong>Regression Analysis</strong> to understand the relationships between different factors and cost allocations.</li>\n  <li><strong>Decision Trees</strong> for their simplicity and ease of interpretation, providing clear decision paths.</li>\n  <li><strong>Naive Bayes</strong> for its probabilistic approach, suited for handling high-dimensional data.</li>\n  <li><strong>Neural Networks</strong> to model complex, non-linear relationships inherent in the financial data.</li>\n  <li><strong>Ensemble Methods</strong> to enhance predictive accuracy by combining multiple models.</li>\n</ul>\n\n<p>Integration with the <a href=\"https://www.sap.com/products/technology-platform/data-intelligence.html\">SAP Data Intelligence platform</a> was a crucial step, ensuring that the machine learning algorithm could be directly applied within STMicroelectronics’ existing procurement processes.</p>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The implementation of the machine learning-based cost allocation system marked a significant improvement for STMicroelectronics. The system achieved a 90% accuracy rate in automatically allocating costs, significantly streamlining the process. This automation allowed financial controllers to focus on the 10% of cases that required manual intervention, thus optimizing both time and resources. The project not only resulted in cost savings but also set a new standard for financial process efficiency in the semiconductor industry.</p>\n","url":"/portfolio/semiconductor","relative_path":"_projects/2022-01-15-semiconductor.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2022-11-15 00:00:00 -0600","title":"Enhancing Efficiency and User Experience for a Health Agency Platform","subtitle":"Business Analysis","image":"/images/ba-swiss-healthcare.png","slug":"ba-healthcare","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n<p>A state health agency handling invoices between healthcare providers and insurances, faced significant challenges with its aging operational web platform. Despite its critical role in managing over 300,000 invoices yearly, the platform struggled with a discrepancy between the collaborators’ needs and the available features. The outdated technology stack, inefficient business processes, and an interface that no longer met user requirements needed a comprehensive revamp of the system.</p>\n","content":"<h3 id=\"problem\">Problem</h3>\n<p>A state health agency handling invoices between healthcare providers and insurances, faced significant challenges with its aging operational web platform. Despite its critical role in managing over 300,000 invoices yearly, the platform struggled with a discrepancy between the collaborators’ needs and the available features. The outdated technology stack, inefficient business processes, and an interface that no longer met user requirements needed a comprehensive revamp of the system.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>As a Business Analyst, I played a pivotal role in the initiative to transform the web platform, with a strong emphasis on user-centricity and efficiency. This project unfolded through a series of carefully orchestrated steps:</p>\n\n<ol>\n  <li>\n    <p><strong>User Experience Revamp</strong>: Utilizing mockups and clickable prototypes, we redesigned the user experience of the Web App. We introduced standardized front-end components to the user interface, ensuring a more intuitive and user-friendly environment.</p>\n  </li>\n  <li>\n    <p><strong>Business Process Automation</strong>: We analyzed and re-engineered business processes to minimize repetitive tasks and align the system with the actual user requirements. This strategic automation significantly reduced time and effort spent on low-value activities.</p>\n  </li>\n  <li>\n    <p><strong>Technology Stack Upgrade</strong>: Acknowledging the limitations of the outdated technology stack, we upgraded the system to comply with the most recent industry standards, ensuring robust performance, security, and scalability.</p>\n  </li>\n</ol>\n\n<h3 id=\"tools-used\">Tools Used</h3>\n<ol>\n  <li>\n    <p><strong>Jira</strong>: Employed for project management, tracking progress, and ensuring transparent communication among all project stakeholders. Jira was instrumental in managing the development sprints, documenting requirements, and tracking issues and resolutions throughout the project lifecycle.</p>\n  </li>\n  <li>\n    <p><strong>Confluence</strong>: Served as the central repository for all project documentation, including requirements, design specifications, and user guides. Confluence facilitated effective knowledge sharing and collaboration among the project team.</p>\n  </li>\n  <li>\n    <p><strong>Slack</strong>: Used as the primary communication platform, Slack enabled real-time discussions, quick resolution of queries, and seamless collaboration among the team members, ensuring that everyone was aligned and informed throughout the project.</p>\n  </li>\n</ol>\n\n<h3 id=\"outcome\">Outcome</h3>\n<p>The revamped web platform marked a significant milestone in improving operational efficiency and user satisfaction. By closely involving stakeholders in each iteration and focusing on user-centric design and process automation, the project delivered a modern, efficient, and user-friendly solution. The outcome was not just a technologically advanced platform but also a testament to the positive impact on the collaborators’ day-to-day tasks, reflected in their increased efficiency and the visible satisfaction upon the deployment of the new solution. This transformation not only streamlined the invoice handling process but also set a benchmark for future digital initiatives within the healthcare sector.</p>\n","url":"/portfolio/ba-healthcare","relative_path":"_projects/2022-11-15-ba-healthcare.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2023-01-09 22:30:35 -0600","title":"Automating Social Media Engagement for Reus Pharma","subtitle":"Digital Marketing","image":"/images/feedly-zapier-bot.png","slug":"feedly","ext":".md","tags":[],"excerpt":"<blockquote>\n  <p>Adrian’s creativity in automating Reus Pharma’s social media engagement was truly innovative, significantly enhancing our online presence with minimal resource investment. This cost-effective strategy not only elevated our content quality but also ensured our consistent visibility and engagement across platforms.</p>\n</blockquote>\n","content":"<blockquote>\n  <p>Adrian’s creativity in automating Reus Pharma’s social media engagement was truly innovative, significantly enhancing our online presence with minimal resource investment. This cost-effective strategy not only elevated our content quality but also ensured our consistent visibility and engagement across platforms.</p>\n</blockquote>\n\n<p><strong>Gustavo Alejos Jansá, Managing Director at Reus Pharma</strong></p>\n\n<h3 id=\"problem\">Problem</h3>\n<p><a href=\"https://www.reuspharma.com/\">Reus Pharma</a>, a growing pharmaceutical company headquartered in Guatemala was seeking to amplify its social media presence, but faced challenges in consistently publishing timely, relevant, and platform-optimized content. The manual process of content curation, customization, and posting was resource-intensive and lacked the necessary promptness and platform-specific adaptation. Additionally, the company wanted to amplify its online visibility without the need to hire a dedicated social media manager, aiming for a cost-effective yet efficient solution.</p>\n\n<h3 id=\"solution\">Solution</h3>\n<p>To address these challenges, a social media bot that automated the process of content curation, posting, and optimization was designed and implemented. The solution involved:</p>\n\n<ol>\n  <li>\n    <p><strong>Content Curation</strong>: Leveraging Feedly AI, the solution continuously monitors and aggregates trending and pertinent articles from diverse sources, ensuring a steady stream of quality content.</p>\n  </li>\n  <li>\n    <p><strong>Automated Posting</strong>: Through Zapier’s powerful automation, the bot instantly creates posts whenever a selected article is added to a designated Feedly board. These posts include captivating images from the articles and concise summaries, enhancing visual appeal and engagement.</p>\n  </li>\n  <li>\n    <p><strong>Content Optimization with ChatGPT</strong>: Recognizing the nuances of different social media platforms, ChatGPT is integrated to refine the text summaries further. This AI model adeptly corrects texts, tailors the tone and style for platforms like Instagram and LinkedIn, and ensures that the content resonates well with the target audience, enhancing engagement and relevance.</p>\n  </li>\n</ol>\n\n<p><img src=\"/images/screenshot-feedly-reus.png\" alt=\"Solution\" /></p>\n\n<p class=\"image-caption\"><em>Streamlining social media posts with just a click: save the article to board on Feedly, and the article is automatically published on social media.</em></p>\n\n<h3 id=\"tools-used\">Tools Used</h3>\n\n<ul>\n  <li><strong>Feedly</strong>: For real-time monitoring and aggregation of industry-relevant content.</li>\n  <li><strong>Zapier</strong>: To orchestrate the use of Feedly, ChatGPT and the publishing on social media platforms, automating the content posting process.</li>\n  <li><strong>ChatGPT</strong>: For intelligent text correction, summarization, and platform-specific content adaptation, ensuring high-quality, engaging posts.</li>\n</ul>\n\n<h3 id=\"outcome\">Outcome</h3>\n\n<p>The implementation of this automated social media bot transformed the company’s digital engagement strategy:</p>\n\n<ul>\n  <li><strong>Streamlined Operations</strong>: The automation reduced the time and resources spent on social media management, allowing the team to focus on strategic initiatives.</li>\n  <li><strong>Elevated Content Quality</strong>: Integration with ChatGPT ensured that each post was not only grammatically impeccable but also fine-tuned for specific social media platforms, resulting in higher engagement rates.</li>\n  <li><strong>Consistent and Timely Online Presence</strong>: The company’s social media channels witnessed a surge in activity, engagement, and follower growth, reinforcing its position as a thought leader in the pharmaceutical sector.</li>\n</ul>\n\n<p>This initiative showcased how strategic automation and AI integration could effectively transform social media management, enhancing operational efficiency and significantly boosting online engagement and brand visibility, all while circumventing the need for a specialized social media manager.</p>\n","url":"/portfolio/feedly","relative_path":"_projects/2023-01-10-feedly.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2023-01-09 22:30:35 -0600","title":"Product Recommendation Pipeline for a Food Delivery Online Marketplace","subtitle":"Data Analysis","image":"/images/food_recs.jpg","slug":"food-recommendations","ext":".md","tags":[],"excerpt":"<h3 id=\"problem\">Problem</h3>\n","content":"<h3 id=\"problem\">Problem</h3>\n\n<p>An online delivery marketplace aimed to boost its revenue by integrating data-driven improvements into its user experience. After evaluating the data availability and practicality of various use cases, we decided to initiate a proof-of-concept initiative focusing on product recommendations within the food segment.</p>\n\n<p>In 2023, the food segment generated over $6 million from 205,000 orders on the marketplace. The company had underutilized data that wasn’t leveraged for analytics or data-driven decisions, and the user interface lacked personalized recommendations. The client aimed to use data science to enhance the user experience with personalized food recommendations.</p>\n\n<h3 id=\"solution\">Solution</h3>\n\n<p>Drawing inspiration from <a href=\"https://www.uber.com/en-CH/blog/uber-eats-recommending-marketplace/\">Uber Eats’ advanced recommendation techniques</a>, we designed a proof-of-concept product recommendation pipeline combining content-based and collaborative filtering methods to deliver personalized food suggestions. The development process included several key steps:</p>\n\n<ol>\n  <li><strong>Data Collection</strong>: Extract and manipulate relevant user and product data, converting information into tabular data for in-depth analysis.</li>\n  <li><strong>Exploratory Data Analysis (EDA)</strong>: Conduct a comprehensive exploratory data analysis to identify patterns and relationships within the data.</li>\n  <li><strong>Content-Based Filtering</strong>: Create user and food taste profiles, and calculate similarity scores between user tastes and product profiles.</li>\n  <li><strong>Collaborative Filtering</strong>: Leverage users’ purchase histories to identify products favored by similar users.</li>\n  <li><strong>Hybrid Approach</strong>: Integrate content-based and collaborative filtering techniques to recommend items based on previous preferences and popular items among similar users.</li>\n</ol>\n\n<p><img src=\"/images/prod_recs.jpg\" alt=\"Product Recommendations explained\" /></p>\n\n<p class=\"image-caption\"><em>The conceptual difference between content-based and collaborative filtering techniques</em></p>\n\n<h3 id=\"tools-used\">Tools Used</h3>\n\n<ul>\n  <li><strong>MongoDB:</strong> Primary database for storing user and product data.</li>\n  <li><strong>Python:</strong> The primary programming language for developing the recommendation algorithms and performing data analysis.</li>\n  <li><strong>Pandas:</strong> Utilized for data manipulation and analysis to convert raw data into insights.</li>\n  <li><strong>Matplotlib:</strong> Primary library used to visualize data trends and algorithmic outputs.</li>\n  <li><strong>Sklearn (DictVectorizer):</strong> Used for encoding categorical data into numerical vectors, critical for our machine learning models.</li>\n</ul>\n\n<h3 id=\"outcome\">Outcome</h3>\n\n<p>The proof-of-concept recommendation pipeline demonstrated the potential to implement complex AI-driven solutions in real-world scenarios. Its success marks a promising step towards extending recommendation services to other segments of the marketplace, potentially transforming the shopping experience for customers across various categories. Additionally, this initiative highlights the importance of well-structured, ordered, and maintained data for making data-driven decisions. It also reveals gaps in existing data pipelines that, once addressed, could further refine the user experience.</p>\n","url":"/portfolio/food-recommendations","relative_path":"_projects/2024-04-01-food-recommendations.md","permalink":null}],"testimonials":[{"draft":false,"categories":[],"layout":"default","name":"Atif Aziz","position":"Principal Software Engineer at Microsoft","image":"images/atif.jpg","blurb":"Adrian does not shy away from challenges. I have seen tech professionals with years of industrial experience have trouble where he delivers with ease.","title":"1atif","slug":"1atif","ext":".md","tags":[],"excerpt":"\n","date":"2024-07-14 16:06:06 -0500","content":"\n","url":"/testimonials/1atif.html","relative_path":"_testimonials/1atif.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Haider Alleg","position":"Global Head of Digital at Ferring Pharmaceuticals","image":"images/haider.jpg","blurb":"Adrian can handle even the most challenging assignments with great success thanks to his distinct flair for organisation and planning.","title":"2haider","slug":"2haider","ext":".md","tags":[],"excerpt":"\n","date":"2024-07-14 16:06:06 -0500","content":"\n","url":"/testimonials/2haider.html","relative_path":"_testimonials/2haider.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Omid Shahmirzadi, PhD","position":"Quantitative Strategist at Millenium","image":"images/omid.jpg","blurb":"Adrian showcased a commendable work ethic and reliability. He efficiently used his skills in data science, data engineering, and software engineering to deliver valuable products of use to the team.","title":"3omid","slug":"3omid","ext":".md","tags":[],"excerpt":"\n","date":"2024-07-14 16:06:06 -0500","content":"\n","url":"/testimonials/3omid.html","relative_path":"_testimonials/3omid.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Cosmin Rusu","position":"Founder and Lead Software Engineer at Duty Ventures","image":"images/cosmin.jpg","blurb":"Adrian is organized, plans well and is a proactive communicator. His ability to take action make him a great entrepreneur.","title":"4cosmin","slug":"4cosmin","ext":".md","tags":[],"excerpt":"\n","date":"2024-07-14 16:06:06 -0500","content":"\n","url":"/testimonials/4cosmin.html","relative_path":"_testimonials/4cosmin.md","permalink":null}],"data":{"general_settings":{"title":"Adrian Guerra","description":"Adrian Guerra - Freelancing Services","social_media_share_image":"/images/AG.jpg","disqus-identifier":null,"google-analytics":"G-4RW0YMJE1V"},"footer":{"footer-menu-settings":{"menu-items":[{"title":"Home","url":"/"},{"title":"About","url":"/about/"},{"title":"Blog","url":"/blog/"},{"title":"Portfolio","url":"/portfolio/"},{"title":"Services","url":"/services/"}]},"copyright_text_html":"<p>&copy;2023 <a href=\"/\">Adrian Guerra Consulting.</a> All Rights Reserved.</p>"},"newsletter":{"newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"adriguerra.us21.list-manage.com/subscribe/post?u=797ad5c238231ca5a3ca3478e&amp;id=3ef0806f26&amp;f_id=00fffbe6f0","newsletter_button":"Subscribe"},"author":{"author_name":"Adrian Guerra","author_image":"/images/IMG_8447.jpg"},"navigation":{"logo_image":"/images/Adrian_Guerra.svg","logo_image_white":"/images/Adrian_Guerra_White.svg","menu-settings":{"menu-items":[{"title":"About","url":"/about/"},{"title":"Portfolio","url":"/portfolio/"},{"title":"Blog","url":"/blog/"},{"title":"Contact","url":"/#contact"}]}},"social_links":{"social":[{"icon":"instagram","link":"https://instagram.com/adriguerra/"},{"icon":"Linkedin","link":"https://linkedin.com/in/adriguerra/"},{"icon":"Github","link":"https://github.com/adriguerra"}]}},"baseurl":null,"title":"Adrian Guerra"}}