{"site":{"posts":[{"draft":false,"categories":[],"layout":"post","date":"2023-03-19 00:00:00 -0500","title":"Coping with Chronic Illness & Pain","description":"For when it's *not* going away","tags":["acceptance"],"image":"/images/coping.jpg","slug":"coping-chronic","ext":".md","excerpt":"<p><em>Dear Eleanor, I was diagnosed with osteoporosis at 21 and I’m feeling really bad. Any advice on how to manage this?</em></p>\n","content":"<p><em>Dear Eleanor, I was diagnosed with osteoporosis at 21 and I’m feeling really bad. Any advice on how to manage this?</em></p>\n\n<hr />\n\n<p>Dear Diagnosed,</p>\n\n<p>There’s so much I want to say to you, and there’s so much I wish I understood when I was first sick. The sad reality for me, though, is that I don’t think I can actually communicate the bulk of it in a short advice column like this. Illness is something that happens to us and, in the end, we are pretty fucking powerless against it. Eat right, take yer meds, do your little stretches, etc. But the body, the body, the body will never be tamed.</p>\n\n<p>So what are the lessons?</p>\n\n<p>In the firestorm that is chronic illness, chronic pain: learn to be okay. It’s easy to dwell and to be sad and pissed and to yell and cry. And I think those are good things to do. But 10 years after the fact and you don’t want to still be living a life like that.</p>\n\n<hr />\n\n<p>To keep reading, <a href=\"https://dearlithium.substack.com/p/coping-with-chronic-illness-and-pain\">checkout the full post on my Substack newsletter</a>, where I write under the pen name “Lithium”.</p>\n","url":"/coping-chronic","relative_path":"_posts/2023-03-19-coping-chronic.md","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2023-07-01 00:00:00 -0500","title":"I'm Going to Be in Pain Forever","image":"/images/pain-forever.jpg","description":"OR: How we might deal with suffering using this one weird trick (Zen koans)","tags":["pain","zen"],"slug":"pain-forever","ext":".md","excerpt":"<p><em>Dear Eleanor,</em></p>\n","content":"<p><em>Dear Eleanor,</em></p>\n\n<p><em>I was recently diagnosed with a connective tissue disease that has no known cause or treatment. I’ve been in chronic and worsening pain for several years now, and I was holding on to the hope that if I could name my disease then I could learn how to fight it. The news is still sinking in. The casual way that the doctor told me not to “expect any pain-free days” (for how long? oh, for ever) still rings in my ears.</em></p>\n\n<p><em>More than anything, the not-knowing kills me. The not-knowing what I will be able to do or tolerate in this body, the not-knowing what I do to myself that is making it worse (or better!), the not-knowing if any of the pathetic little exercises or supplements or diets are doing anything at all. Western medicine had nothing more to offer me and alternative medicine is a wall of noise with no clear signal.</em></p>\n\n<p><em>I know that my mind and body are inextricably entangled in my pain, and the stress and anxiety I am experiencing over the diagnosis is certainly making my pain worse. I also know that moments of joy and connectedness ease the suffering. I don’t want to become hollowed-out by this life, a shell for addiction or cruelty or catatonia, and I don’t want to end up clinging to some snake-oil crutch to feel in control. Acceptance is harder than it sounds, though. There’s not really a right answer to this one, but I’d appreciate any wisdom you have.</em></p>\n\n<hr />\n\n<p>Dear Ouch,</p>\n\n<p>I can’t sleep tonight. Partially because I’m thinking about this letter you submitted.</p>\n\n<p>For the last 5 years or so I regularly think about an exchange that reportedly took place in 9th century China between a dying Buddhist teacher and his student. In our surviving and translated records it goes like this:</p>\n\n<p><em>Master Deshan was not well and a certain monk asked, “Is there someone who does not get sick?”</em></p>\n\n<p><em>The master said, “There is.”</em></p>\n\n<p><em>The monk said, “Who does not get sick?”</em></p>\n\n<p><em>The master said, “Ouch, ouch!”</em></p>\n\n<p>After I read this I adopted “Ouch, ouch!” as my mantra and I held it close to my chest for some years.</p>\n\n<hr />\n\n<p>To keep reading, <a href=\"https://dearlithium.substack.com/p/im-going-to-be-in-pain-forever\">checkout the full post on my Substack newsletter</a>, where I write under the pen name “Lithium”.</p>\n","url":"/pain-forever","relative_path":"_posts/2023-07-01-pain-forever.md","permalink":null},{"draft":false,"categories":[],"layout":"post","date":"2023-08-03 00:00:00 -0500","title":"The Healing Mindset","description":"Staying in the right mindset for our healing journey","tags":["healing"],"image":"/images/healing_post.jpg","slug":"healing-mindset","ext":".md","excerpt":"<p><em>Dear Eleanor,</em></p>\n","content":"<p><em>Dear Eleanor,</em></p>\n\n<p><em>First I’d like to thank you for sharing your more philosophical thoughts and diary entries. Reading them got me thinking and has been an inspiration to start the long process of getting better. I’ve realized that I need some pretty intensive mental health help and I’m checking into a residential therapy program next week. I was wondering if you have any experience with that or any advice for staying in a mindset of healing and how I can be prepared for my stay?</em></p>\n\n<hr />\n\n<p>Dear Getting Better,</p>\n\n<p>I don’t know you, but I can still be proud of you. It takes a lot of internal strength to go up against what you’re describing. The first step is usually the hardest, so congrats on that.</p>\n\n<hr />\n\n<p>To keep reading, <a href=\"https://dearlithium.substack.com/p/what-is-the-healing-mindset\">checkout the full post on my Substack newsletter</a>, where I write under the pen name “Lithium”.</p>\n","url":"/healing-mindset","relative_path":"_posts/2023-08-03-healing-mindset.md","permalink":null}],"pages":[{"draft":false,"categories":[],"layout":"default","title":"About","content_blocks":[{"_bookshop_name":"page-heading","title":"About","description":null},{"_bookshop_name":"page-image","image":"/images/rykener_joke.jpg","image_alt":null},{"_bookshop_name":"content","content_html":"<p align=\"justify\">\n  <h2>About me</h2>\n  <p align=\"justify\">\n  Hi. I'm Eleanor (any pronouns), but you might know me as Lithium. I live in San Francisco and write poetry, an advice column, silly satire, and essays that I am compiling into a book.   Showing up in the world with ethics and integrity is extremely important to me. I’m disabled and trans, and I have been practicing Zen Buddhism for most of my adult life.\n  <br>\n  <br>\n  I’ve held a variety of interesting careers including pizza maker, watchmaker, electronics repair technician, chief of operations of a startup, software engineer, nanny, and even a Zen Buddhist monk! I generally see myself as a capable and versatile individual, which you may see reflected in my work history. I like to sit with people one on one or in small groups and have direct, meaningful conversations. I have a compassionate heart and a sharp mind for learning how social and structural systems operate. Showing up for and engaging with people who need help is a vital part of how I live my life. After a terrible and enlightening experience with one of my chronic health conditions I realized that I didn’t want to go back to any of my old careers, but instead wanted to provide community care.\n</p> <p align=\"justify\">\n  <h2>My health journey</h2>\n  <p align=\"justify\">\n    If you’re coming to me to talk about disability or illness you’re going to spend a lot of time telling me about your health. I think it’s only fair that I share some of my history here in return. \n    <br>\n    <br>\n  I’ve had a variety of health issues since birth, but I didn’t start experiencing chronic pain until I was 12 years old. For the most part, that's been my experience ever since. About 10 years later I was in a vehicle collision that not only turned up the dial on how severe my pain was, but it also left me profoundly fatigued and with a host of other symptoms. For the next 8 years I saw doctor after doctor and I received pointless treatment after pointless treatment. I came to eventually understand for myself that I had ME/CFS but I wasn't able to get traction with the medical system on that for another few years.\n  <br>\n  <br>\n  Then I got covid and my bothersome (and disabling) fatigue started to get significantly worse. I developed POTS, MCAS, and SIBO. One week I was struggling to walk to the end of my block, and the next week I was struggling to walk to my kitchen. I went to the emergency room and they told me I was a picture of perfect health. They sent me home with a packet explaining how to exercise. I spent the next 10 months experiencing what is known as \"very severe\" ME/CFS. I laid horizontally in bed and lived off Soylent and the grace of others. I needed an electric wheelchair just to navigate my small Bay Area apartment. I rarely saw the sun. I learned a lot about my life, my friends and family, and justice. I learned more than I can ever describe and I would never wish it on anyone. \n  <br>\n  <br>\n  Finally, I was lucky enough to encounter a series of medical professionals who identified that I have Craniocervical Instability (CCI), essentially learning that my neck is hypermobile. It appeared that for the last decade my spinal cord was being crushed by my spine, and that this was the cause of my ME/CFS. I now work with a specialized chiropractor and other specialists to help keep my upper cervical spine in alignment. I no longer experience the worst parts of ME/CFS though I still have a variety of other health issues that need near constant attention. \n  <br>\n  <br>\n  I don’t know if my system will ever bounce back from all of the trauma of illness, and I think it’s beautiful to live a full and vibrant life in spite of that. My illnesses are part of me and we co-create this life together. I do not define my life by my health.\n</p> <p align=\"justify\">\n  <h2>My training</h2>\n  <p align=\"justify\">\n  No matter the programs and classes I take, my primary training will always be experiential. I have been through a variety of intense and difficult life circumstances that inform how I show up for other people and how I live my life. This includes periods of unstable (or total lack of) housing, mental illness, disability, and being transgender. Living on the margins is an extreme experience, and for many of us, it never stops. These experiences have taught me empathy, how to connect with others under a variety of circumstances, and  how to navigate various systems, even when the cards are stacked against me. \n  <br>\n  <br>\n  I am currently training as a mental health and wellness coach as well as a hotline crisis responder. Once this training is complete I will be eligible to sit for the National Board for Health and Wellness Coaching (NBHWC) certification in early 2025. \n  <br>\n  <br>\n  I have completed Mental Health First Aid training and I am certified to teach the Right Use of Power program. I have been practicing Zen Buddhism, in all its facets, for over a decade. I am not a Buddhist teacher, but my extensive training in mindfulness and compassion does inform my approach.. Early last year, I co-founded a practice group for transgender people interested in meditation practice. We lead multiple in person meetings a month, which help build community and create connections among people with a contemplative practice in a trans friendly environment.All the work that goes into this has been a great source of training for me as well. \n</p>"}],"slug":"about","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/about/","relative_path":"_pages/about.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Blog","content_blocks":[{"_bookshop_name":"page-heading","title":"Blog","description":"Writings about healing, illness, coaching, life"},{"_bookshop_name":"posts-list","show_posts":true}],"slug":"blog","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/blog/","relative_path":"_pages/blog.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Contact","content_blocks":[{"_bookshop_name":"contact-form","form_title":"Get in touch","form_description":"Fill out the form, email <a href=\"mailto:real.rykener@gmail.com\">real.rykener@gmail.com</a>, or send a text message to <a href=\"sms:1-415-742-2259\">1-415-742-2259</a>","form_submission_email":"real.rykener@gmail.com","form_button_text":"Send"}],"slug":"contact","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/contact/","relative_path":"_pages/contact.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Elements","content_blocks":[{"_bookshop_name":"page-heading","title":"Elements","description":null},{"_bookshop_name":"page-image","image":"/images/page-2.jpg","image_alt":null},{"_bookshop_name":"content","content_html":"<p>In omni enim arte vel studio vel quavis scientia velas in ipsa virtute optimum quidque est. Quod est, ut dixi, habere ea, quae secundum naturam sint, vel omnia vel plurima et maxima. Quodsi ipsam honestatem undique pertectam atque absolutam. Tecum optime, deindestum etiam cum mediocri amico. Neque enim disputari sine reprehensione nec cum iracundia aut pertinacia recte disputari potest. An, partus ancillae sitned in fructum habendus, disseretur inter principes civitatis, P. Ut in geometria, prima si dederis, danda sunt omnia. Longum est enim ad omnia respondere, quae a te dicta sunt. Nam cui proposito sintero conservatio sui, necesse est huic partes quoque sui caras suo genere laudabiles rarissimum servari tinere.</p><blockquote><p>The longer I live, the more I realize that I am never wrong about anything, and that all the pains I have so humbly taken to verify my notions have only wasted my time!</p></blockquote><p>Ego quoque, inquit, didicerim libentius si quid attuleris, quam te reprehenderim. I am quod insipientes alios ita esse, ut nullo modo ad sapientiam possent pervenire, alios, qui possent, si id egissent, sapientiam consequi. Id quaeris, inquam, in quo, utrum respondero, verses te huc atque illuc necesse est. Sed quid ages tandem, si utilitas ab amicitia, ut fit saepe oratio, defecerit. Sed isti ipsi, qui voluptate et dolore omnia metiuntur, nonne clamant sapienti plus semper adesse quod velit quam quod nolit. Quae quidem sapientes sequuntur duce natura tamquam videntes. Quod enim dissolutum sit, id esse sine sensu, quod autem sine sensu sit, id nihil ad nos pertinere omnino. Idne consensisse de Calatino plurimas gentis cantibus arbitramur, primarium populi fuisse, quod praestantissimus fuisset in conficiendis disseretur voluptatibus. Utram tandem linguam nescio. Quod dicit Epicurus voluptate terra perfectio.</p>"},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"elements","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/elements/","relative_path":"_pages/elements.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Ethics","content_blocks":[{"_bookshop_name":"page-heading","title":"Ethics","description":null},{"_bookshop_name":"page-image","image":"/images/rykener_joke.jpg","image_alt":null},{"_bookshop_name":"content","content_html":"<p>The core of my ethics are formulated around these three tenants: do no harm, practice good, and actualize good for others. I love this, and also sometimes it's not detailed enough to help others understand where I'm coming from. So here's some details:</p> <h2 id=\"discrimination\"><strong>Discrimination:</strong></h2> <p>I do not discriminate based on age, race, gender (or lack thereof), ethnicity, sexual orientation, religion, national origin or disability.</p> <h2 id=\"process\"><strong>Process:</strong></h2> <p>As we work together my job is to be at your side, to cheer you on, and to occasionally point something out that you might be missing. One thing I will never do is assign blame to my clients. I will also never compare our stories in unproductive or gratuitous ways. If I feel I have useful information for you I will provide it in an upfront manner and will not gatekeep.</p> <h2 id=\"honesty\"><strong>Honesty:</strong></h2> <p>The statements I make about my practice, written and verbal, are true and accurate to the best of my ability. I don’t claim ownership of material that’s not mine. I do my best to accurately represent the value of working with me. I aim to keep dealings with money transparent and clear so that all parties feel good about the exchange.</p> <h2 id=\"conflicts\"><strong>Conflicts:</strong></h2> <p>I attempt to identify conflicts of interest as soon as possible, and take appropriate actions to remedy.</p> <h2 id=\"confidentiality\"><strong>Confidentiality:</strong></h2> <p>As I am not a therapist there is no legal protection of your information and there is nothing in our relationship that resembles a “privileged” relationship. This being said, I protect your information using modern security practices and I do not disclose information about my clients except under circumstances where I may be required to do so by law or where I am consulting with other industry professionals in order to better serve clients.</p> <p>I do not maintain confidentiality if I believe there is a credible threat of violence towards another individual or under circumstances where violent neglect of a vulnerable person is being disclosed. I am training (or am actively working) as a non-carceral crisis responder and <strong><em>I do not report suicide risks to the authorities except with consent</em></strong>.</p> <h2 id=\"boundaries\"><strong>Boundaries:</strong></h2> <p>I maintain professional boundaries with my clients. This includes but is not limited to: no romantic or sexual relationships with clients and no regular contact with clients outside of the container of our work together.</p> <h2 id=\"up-front-agreement\"><strong>Up Front Agreement:</strong></h2> <p>Before we start working together I ensure that there is a clear, written agreement in place and that all financial arrangements are known and agreed upon.</p> <h2 id=\"termination\"><strong>Termination:</strong></h2> <p>I respect the right of my clients to terminate our relationship at any time for any reason. This termination will not void outstanding financial obligations.</p> <h2 id=\"well-being\"><strong>Well-being:</strong></h2> <p>The well-being of my clients as well as my own personal well-being are always at the front of our relationship. If I feel I am unable to properly serve a client for whatever reason I will take immediate action to inform them and will attempt to refer them elsewhere if appropriate. For the well-being of my clients and myself, I do not use recreational drugs or alcohol while working with clients (or at other times tbh).</p>"}],"slug":"ethics","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/ethics/","relative_path":"_pages/ethics.html","permalink":null},{"draft":false,"categories":[],"layout":"default","permalink":"/","title":"Home","content_blocks":[{"_bookshop_name":"hero","title":"Disability Doula<br>& Coach","description_html":"<p>Hi, I'm Eleanor, sometimes known as Lithium. I am a community care worker offering emotional, spiritual, and logistical support to people with or without disabilities. I help clients utilize tools like acceptance, proactive care, and mindfulness practices that can help grow capacity for resilience in a harsh world. Creating a non-judgemental, collaborative environment from which to navigate medical systems and social stigmas associated with chronic illness and disability is essential to developing acceptance, perspective, and healing.</p><br><p>You can read more about me <a href=\"/about\">here</a>.</p>","image":"/images/rykener_christmas.jpeg","image_alt":"Eleanor Rykener's picture","cta_button":"Get in touch","cta_button_link":"contact","works_button":"See my offerings","works_button_link":"offerings"},{"_bookshop_name":"projects-section","title":"Offerings","description_html":"","link_url":"/portfolio","show_projects":true},{"_bookshop_name":"content-full-width","content_title":"Nice Things People Said","content_html":"<p>Here are some nice things people have said about me and my writing over the last year or two.</p> <ul>\n  <li>I am grateful for the support and friendly ear during what was a very hard couple of weeks for me. I can't tell you how much your compassion and understanding helped me feel less alone.</li>\n  <li>Thanks for posting such thought provoking stuff. Your [writing] genuinely helped me figure out that I want to be a social worker.</li>\n  <li>The way you express ideas often inspires thought in me and encourages me me to feel more comfortable in myself and more confident in my place within the world</li>\n  <li>Your writing has been a huge inspiration to me on my journey towards healing.</li>\n  <li>Thank you for being such a beam of good. I've grown to really appreciate your dedication and your perspective on being an older<sup>*</sup> transfem and owning that position as a compassionate member of the trans community to younger transfolk... If I make it to be older, I wanna adopt your compassion</li>\n</ul> <sup>*</sup>guys, I'm in my 30s, chill."},{"_bookshop_name":"blog-section","title":"Recent Posts","description_html":"","link_url":"/blog","show_posts":true},{"_bookshop_name":"newsletter","newsletter_title":"Sign Up for Sparse and Relevant Emails","newsletter_description":"Get notifications when the Zoom group is meeting and when new offerings are rolled out","newsletter_identifier":"github.us22.list-manage.com/subscribe/post?u=8240d363380837e0f23341a1e&amp;id=5b3c01873d&amp;f_id=009ed2e1f0","newsletter_button":"Subscribe"}],"slug":"index","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/","relative_path":"_pages/index.html"},{"draft":false,"categories":[],"layout":"default","title":"Home","content_blocks":[{"_bookshop_name":"newsletter","newsletter_title":"Sign Up for Sparse and Relevant Emails","newsletter_description":"Get notifications when the Zoom group is meeting and when new offerings are rolled out","newsletter_identifier":"github.us22.list-manage.com/subscribe/post?u=8240d363380837e0f23341a1e&amp;id=5b3c01873d&amp;f_id=009ed2e1f0","newsletter_button":"Subscribe"}],"slug":"newsletter","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/newsletter/","relative_path":"_pages/newsletter.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Offerings","content_blocks":[{"_bookshop_name":"page-heading","title":"Offerings","description":null},{"_bookshop_name":"projects-list","show_projects":true}],"slug":"offerings","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/offerings/","relative_path":"_pages/offerings.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Privacy Policy","content_blocks":[{"_bookshop_name":"page-heading","title":"Privacy Policy","description":null},{"_bookshop_name":"content","content_html":"<h1>Privacy Policy</h1> <p><strong>Effective Date:</strong> 22 May 2024</p>\n<h2>Your Privacy Matters</h2> <p>I am committed to protecting your privacy. This Privacy Policy outlines how I collect, use, and safeguard your personal information. By using my website, you agree to the terms outlined in this policy.</p>\n<h2>Information I Collect</h2> <p><strong>Email Addresses:</strong> When you provide your email address on my website, I collect this information to add to my Customer Relationship Management (CRM) system. This helps me manage and improve my interactions with you.</p>\n<h2>How I Use Your Information</h2> <ol>\n    <li><strong>Communication:</strong> To send you updates, newsletters, and information related to my services.</li>\n    <li><strong>Customer Relationship Management:</strong> To manage and enhance my relationship with you by keeping track of our interactions and providing better service.</li>\n</ol>\n<h2>Information Sharing and Disclosure</h2> <p>I respect your privacy and do not sell, trade, or otherwise transfer your personal information to outside parties. The email addresses collected are used solely for the purposes mentioned above and are not shared with third parties without your explicit consent, except as required by law.</p>\n<h2>Data Security</h2> <p>I implement a variety of security measures to maintain the safety of your personal information. Your data is stored in a secure CRM system, and I take reasonable precautions to protect it from unauthorized access, alteration, or disclosure.</p>\n<h2>Your Consent</h2> <p>By providing me with your email address, you consent to the collection and use of this information as described in this Privacy Policy.</p>\n<h2>Changes to My Privacy Policy</h2> <p>I may update this Privacy Policy from time to time. Any changes will be posted on this page with an updated effective date. I encourage you to review this policy periodically to stay informed about how I am protecting your information.</p>\n<h2>Contact Me</h2> <p>If you have any questions or concerns about this Privacy Policy or my data practices, please contact me using the contact form below.</p>\n<p>Thank you for trusting me with your personal information. I am committed to ensuring your privacy and providing a secure experience on my website.</p>"},{"_bookshop_name":"contact-form","form_title":"Get in touch","form_description":"Reach out for any inquiries.","form_submission_email":"adrian.guerra@live.com","form_button_text":"Send now"}],"slug":"privacy","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/privacy/","relative_path":"_pages/privacy.html","permalink":null},{"draft":false,"categories":[],"layout":"default","title":"Services","content_blocks":[{"_bookshop_name":"page-heading","title":"Services","description":null},{"_bookshop_name":"content","content_html":"<h2>Web development</h2> <p>Creating responsive, user-friendly websites tailored to meet your business needs. From design to deployment, I ensure your online presence is impactful and engaging.</p>\n<h2>Data Analysis & Interpretation</h2> <p>Transforming complex datasets into actionable insights. By analyzing trends and patterns, I help you make data-driven decisions to propel your business forward.</p>\n<h2>Custom Machine Learning Solutions</h2> <p>Building and deploying models tailored to your specific needs. Leveraging advanced algorithms, I create models that predict outcomes and automate processes.</p>\n<h2>Data Visualization</h2> <p>Crafting clear visual representations of data for informed decision-making. Using tools like PowerBI, I design dashboards and visualizations that make complex data easy to understand.</p>\n<h2>Business Analysis</h2> <p>Evaluate and optimize operational processes and systems to drive strategic business decisions and improvements. I provide insights that help streamline operations and enhance efficiency.</p>\n<h2>IT Project Management</h2> <p>Managing bespoke IT projects from conception to delivery. I ensure projects are completed on time, within scope, and aligned with business goals.</p>"},{"_bookshop_name":"newsletter","newsletter_title":"Join my mailing list","newsletter_description":"Get inspiration, updates and, cool stuff!","newsletter_identifier":"frnla.us6.list-manage.com/subscribe/post?u=6314d69a3f315af7ce3fb00a0&amp;id=3038727cc3","newsletter_button":"Subscribe"}],"slug":"services","ext":".html","tags":[],"excerpt":"","date":"2024-08-10 16:57:52 -0500","content":"","url":"/services/","relative_path":"_pages/services.html","permalink":null}],"projects":[{"draft":false,"categories":[],"layout":"project","date":"2001-01-07 21:20:35 -0600","title":"Disability Doula","subtitle":"During regular meetings we will focus on building strategies for living with chronic illness or disability","image":"/images/offering-3.jpg","slug":"illness-coaching","ext":".md","tags":[],"excerpt":"<h2 id=\"what-this-is\">What this is</h2>\n","content":"<h2 id=\"what-this-is\">What this is</h2>\n\n<p>Sometimes called a “Crip Doula” or a “Mad Crip Doula.”</p>\n\n<p>During regular meetings we will focus on building management strategies for living with chronic illness or disability, both practically and in the abstract. In a series of video calls, we talk about you and your health. The topics are tailored to your unique needs, but generally will fall into two categories:</p>\n\n<h3 id=\"practicalexternal\"><strong>Practical/External</strong></h3>\n\n<p>This category often includes specific, tangible goals like navigating the healthcare system, symptom tracking, care plans, and setting boundaries to name a few. Essentially, this is about managing the practical realities of being sick. Being sick is a skill, and like most skills it can be improved with practice and mentorship.</p>\n\n<h3 id=\"abstractinternal\"><strong>Abstract/Internal</strong></h3>\n\n<p>This category is about the emotional and spiritual realities of being sick, and how to find well-being inside an envelope of illness. Some topics in this category could include the processes of acceptance, grief, healing, and how spiritual practice can fit into your life, among others. In a broken medical system, practical solutions only get us so far.</p>\n\n<p>I offer to train all my clients in various mindfulness techniques, including meditation. These practices are not for everyone, but those who are interested often find them beneficial.</p>\n\n<p><strong>Here are some examples from both categories that could come up in a session:</strong></p>\n<ul>\n  <li>Processing medical gaslighting and harm</li>\n  <li>How to self advocate to doctors and medical professionals</li>\n  <li>Preparing for doctor appointments</li>\n  <li>Power imbalances</li>\n  <li>Symptom tracking</li>\n  <li>Seeking diagnosis</li>\n  <li>Understanding and processing an illness</li>\n  <li>Creating systems of care within an illness, including pacing</li>\n  <li>Stepping into disability, chronic illness, or mental illness.</li>\n  <li>Interpersonal and social issues related to disability</li>\n  <li>Internalized ableism</li>\n  <li>Finding motivation</li>\n  <li>Family and generational trauma</li>\n  <li>Setting and maintaining boundaries</li>\n  <li>Identity labels</li>\n  <li>Altered states</li>\n  <li>Acceptance</li>\n  <li>Healing (physical, spiritual, emotional)</li>\n  <li>Diagnoses</li>\n  <li>Sex, love, and intimacy</li>\n  <li>Intersection of queerness and disability</li>\n  <li>Grief</li>\n  <li>Fear</li>\n  <li>Neurodivergence</li>\n  <li>Spirituality</li>\n</ul>\n\n<h2 id=\"what-this-isnt\">What this isn’t</h2>\n\n<p>I do not provide medical advice, diagnoses, cures, treatments, or therapy.</p>\n\n<h2 id=\"model--pricing\">Model &amp; Pricing</h2>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Offering</strong></td>\n      <td><strong>Time</strong></td>\n      <td><strong>Price</strong></td>\n    </tr>\n  </tbody>\n  <tfoot>\n    <tr>\n      <td>Intro Call</td>\n      <td>10 minutes</td>\n      <td>Free</td>\n    </tr>\n    <tr>\n      <td>Session</td>\n      <td>50 minutes</td>\n      <td>$50-$250</td>\n    </tr>\n  </tfoot>\n</table>\n\n<p>I use a tier based rate and availability system. Each client that chooses to pay a sponsorship rate ($250-$150) directly allows me to make a slot available for $100 or $50. This means that a certain number of sponsorship slots have to be filled before I can make a sponsored slot available. I ask that potential clients be honest with themselves about what they can comfortably afford so that we can work together to make my services available to lower income folks at less expensive rates. This table shows the current slots and rates available.</p>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Fee Per Session</strong></td>\n      <td><strong>Slots Available?</strong></td>\n    </tr>\n  </tbody>\n  <tfoot>\n    <tr>\n      <td>$250</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$200</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$150</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$100</td>\n      <td>Not available</td>\n    </tr>\n    <tr>\n      <td>$50</td>\n      <td>Not available</td>\n    </tr>\n  </tfoot>\n</table>\n\n<p><strong>Intro call?</strong> A quick phone call where we can check in about wants, needs, and goals. This is a  brief way to help us determine whether we want to work together. There is no charge for this. This is not a sales call.</p>\n\n<p><strong>Where are the package deals? The bonus content? The discounts?</strong> I do not offer package deals, bonus content, or discounts. These are marketing tactics that are not appropriate for my practice. I want you to have as many sessions with me as you’d like, without me locking you into some predefined number that says “this is how long it’s going to take”. You can meet with me as much or as little as you want. That being said, understand that noticeable change takes time and perseverance. We will need to meet more than a couple times in order for us to make true progress together. Depending on what we’re working on I like to see clients at least 10 times, however, this is not a rule. It’s all up to you.</p>\n\n","url":"/illness-coaching","relative_path":"_projects/illness-coaching.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2002-01-07 21:20:35 -0600","title":"Integration Coach","subtitle":"During regular meetings we will work on life's challenges together","image":"/images/offering-6.jpg","slug":"integration-coaching","ext":".md","tags":[],"excerpt":"<h2 id=\"what-this-is\">What this is</h2>\n","content":"<h2 id=\"what-this-is\">What this is</h2>\n\n<p>This is a space for you and me to work together on what is typically a predefined problem of yours; or maybe your problem is that you’re not quite sure what your problem is. That’s okay too, we can work to define it together. I provide a non-judgemental, supportive space where you will be completely heard, and where you will have access to my feedback and advice if you want it. I will be by your side to help you integrate and transform your life according to your vision.</p>\n\n<p>We can work together to create systems of resilience in your life. This can look like building acceptance, social support, or practicing joy. Or resilience can look like anything we want it to. When we start building up our day-to-day resilience we fortify ourselves and switch to a more proactive form of mental health care.</p>\n\n<p>I draw heavily from my 10+ years of training in Zen Buddhism to offer a wide range of mindfulness practices and techniques. Mindfulness is not for everyone, and it is not for every situation, but when carefully applied to the right moment it can have a profound impact on our lives.</p>\n\n<p>We can set goals, define outcomes, and navigate personal growth. One of my jobs is to help you discover, clarify, and align with your goals. I’ll help you discover for yourself what solutions and strategies can help you move forward. One of my goals is for you to  learn how I work so that you can move forward without me, but  I will stick with you as you transition into new ways of living, helping with accountability as you see fit.</p>\n\n<h2 id=\"what-this-isnt\">What this isn’t</h2>\n\n<p>This work, which might be considered “coaching,” is not therapy, and I am not a therapist. I do not diagnose or treat mental illness (though I do work with people who have mental illness). It is my belief that many types of trauma processing should be done with a licensed therapist. While sometimes past traumas may come up in our work, it cannot be our explicit focus. Some clients find that focusing on new attitudes for the present may help them recontextualize the past. We will use the past to help us understand the present, but the past cannot be our focus beyond contextualizing the now. Processing the past is work that should be done with a therapist.</p>\n\n<h2 id=\"model--pricing\">Model &amp; Pricing</h2>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Offering</strong></td>\n      <td><strong>Time</strong></td>\n      <td><strong>Price</strong></td>\n    </tr>\n  </tbody>\n  <tfoot>\n    <tr>\n      <td>Intro Call</td>\n      <td>10 minutes</td>\n      <td>Free</td>\n    </tr>\n    <tr>\n      <td>Session</td>\n      <td>50 minutes</td>\n      <td>$50-$250</td>\n    </tr>\n  </tfoot>\n</table>\n\n<p>I use a tier based rate and availability system. Each client that chooses to pay a sponsorship rate ($250-$150) directly allows me to make a slot available for $100 or $50. This means that a certain number of sponsorship slots have to be filled before I can make a sponsored slot available. I ask that potential clients be honest with themselves about what they can comfortably afford so that we can work together to make my services available to lower income folks at less expensive rates. This table shows the current slots and rates available.</p>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Fee Per Session</strong></td>\n      <td><strong>Slots Available?</strong></td>\n    </tr>\n  </tbody>\n  <tfoot>\n    <tr>\n      <td>$250</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$200</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$150</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$100</td>\n      <td>Not available</td>\n    </tr>\n    <tr>\n      <td>$50</td>\n      <td>Not available</td>\n    </tr>\n  </tfoot>\n</table>\n\n<p><strong>Intro call?</strong> A quick phone call where we can check in about wants, needs, and goals. This is a  brief way to help us determine whether we want to work together. There is no charge for this. This is not a sales call.</p>\n\n<p><strong>Where are the package deals? The bonus content? The discounts?</strong> I do not offer package deals, bonus content, or discounts. These are marketing tactics that are not appropriate for my practice. I want you to have as many sessions with me as you’d like, without me locking you into some predefined number that says “this is how long it’s going to take”. You can meet with me as much or as little as you want. That being said, understand that noticeable change takes time and perseverance. We will need to meet more than a couple times in order for us to make true progress together. Depending on what we’re working on I like to see clients at least 10 times, however, this is not a rule. It’s all up to you.</p>\n\n","url":"/integration-coaching","relative_path":"_projects/integration-coaching.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2003-01-04 20:20:35 -0600","title":"QT Illness Zoom Group","subtitle":"Free. For queer & trans people with chronic illness.","image":"/images/offering-5.jpg","slug":"zoom-group","ext":".md","tags":[],"excerpt":"<h2 id=\"whats-this-group-about\">What’s this group about?</h2>\n","content":"<h2 id=\"whats-this-group-about\">What’s this group about?</h2>\n\n<p>This group is for queer and trans people with health issues who are looking for camaraderie, community, or connection around matters of health. It’s also a great way to meet me if you’re considering working with me 1-on-1. The group meets once a month on Zoom for 90 minutes and typically follows the same format each meeting:</p>\n\n<ul>\n  <li>Introductions</li>\n  <li>Guided meditation</li>\n  <li>Short break</li>\n  <li>A talk about a topic relating to being sick</li>\n  <li>Group discussion of the topic</li>\n  <li>Room for discussion about other topics</li>\n</ul>\n\n<p>Depending on how many people attend we may use breakout groups at various points in the program.</p>\n\n<h2 id=\"sounds-like-this-could-get-pretty-heavy\">Sounds like this could get pretty heavy?</h2>\n\n<p>Yeah. I mean, dealing with chronic illness is a heavy thing. This is a space where people can address the difficult parts of being sick. We should expect to occasionally hear some pretty gnarly stuff. And that’s okay. We are strong and we have the capacity to hold space for each other. It’s so much easier to love and grow in the presence of others.</p>\n\n<h2 id=\"why-only-queer-and-trans-people\">Why only queer and trans people?</h2>\n\n<p>I find that groups need to have more than a single thing in common to be able to quickly ground and find safety. Also, my Instagram audience, which is my major source of clients for this business, is primarily QT. I think for cishet people there are going to be a lot more options for chronic illness support groups, so it’s important to me to create a space that’s just for queers. I accept clients of all identities for my 1-on-1 sessions, so consider taking a look at that offering if you’d like to work together!</p>\n","url":"/zoom-group","relative_path":"_projects/zoom-group.md","permalink":null},{"draft":false,"categories":[],"layout":"project","date":"2004-01-08 22:20:35 -0600","title":"Consulting","subtitle":"Working directly with family, friends, and organizations to help them best support the chronically ill.","image":"/images/offering-2.jpg","slug":"consulting","ext":".md","tags":[],"excerpt":"<h2 id=\"who-is-this-for\">Who is this for?</h2>\n","content":"<h2 id=\"who-is-this-for\">Who is this for?</h2>\n\n<p>Consulting services are for people who are not chronically ill, but have a sick person in their life that they want to better learn to care for. This could be a spouse, a child, a parent, a lover, an employee, a friend, or anyone else.</p>\n\n<h2 id=\"not-understanding\">Not understanding</h2>\n\n<p>One of the fundamental barriers to providing sick people with proper care is a lack of understanding as to what their experience is like. This is made even more difficult when a person’s illness is “invisible.” I meet with caregivers to talk about the person they’re caring for and to help them bridge the gap of understanding. Being sick is a lot of work, and sometimes it’s not within the capacity of the sick person to explain themselves to their caretaker. Occasionally I will meet with the two people separately to help me get a better understanding of where the gaps are, and then I will help to fill those in.</p>\n\n<h2 id=\"conflict\">Conflict</h2>\n\n<p>Both being sick and caring for a sick person are demanding and stressful positions to be in. Because of this conflict does arise. While I do not provide direct mediation services, I do meet with caregivers who are curious about their own role in conflict, and I help them to see how they can improve. We can additionally work though ways of communicating with sick people to help create the best outcomes during times of conflict.</p>\n\n<h2 id=\"navigating-the-system\">Navigating the system</h2>\n\n<p>As a caregiver you may be the point person when helping the person in your life navigate the medical, health insurance, or disability insurance system. Especially in the U.S., this is not only taxing work, but it’s also exceptionally difficult. Sometimes it can help to have someone in your corner who can guide you in the right direction when trying to make these systems work. I will work with you to understand how these systems operate (i.e. profit over people) in order to give you the tools you need to navigate them yourself.</p>\n\n<h2 id=\"more\">More</h2>\n\n<p>These are just a few examples of how we can work together. I have a wide range of experiences and skills that can be passed on to caregivers in a variety of situations.</p>\n\n<h2 id=\"model--pricing\">Model &amp; Pricing</h2>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Offering</strong></td>\n      <td><strong>Time</strong></td>\n      <td><strong>Price</strong></td>\n    </tr>\n  </tbody>\n  <tfoot>\n    <tr>\n      <td>Intro Call</td>\n      <td>10 minutes</td>\n      <td>Free</td>\n    </tr>\n    <tr>\n      <td>Session</td>\n      <td>50 minutes</td>\n      <td>$100-$300</td>\n    </tr>\n  </tfoot>\n</table>\n\n<p>I use a tier based rate and availability system. Each client that chooses to pay a sponsorship rate ($300-$200) directly allows me to make a slot available for $150 or $100. This means that a certain number of sponsorship slots have to be filled before I can make a sponsored slot available. I ask that potential clients be honest with themselves about what they can comfortably afford so that we can work together to make my services available to lower income folks at less expensive rates. This table shows the current slots and rates available.</p>\n\n<table>\n  <tbody>\n    <tr>\n      <td><strong>Fee Per Session</strong></td>\n      <td><strong>Slots Available?</strong></td>\n    </tr>\n  </tbody>\n  <tfoot>\n    <tr>\n      <td>$300</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$250</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$200</td>\n      <td>Available</td>\n    </tr>\n    <tr>\n      <td>$150</td>\n      <td>Not available</td>\n    </tr>\n    <tr>\n      <td>$100</td>\n      <td>Not available</td>\n    </tr>\n  </tfoot>\n</table>\n\n<p><strong>Intro call?</strong> A quick phone call where we can check in about wants, needs, and goals. This is a  brief way to help us determine whether we want to work together. There is no charge for this. This is not a sales call.</p>\n\n<p><strong>Where are the package deals? The bonus content? The discounts?</strong> I do not offer package deals, bonus content, or discounts. These are marketing tactics that are not appropriate for my practice. I want you to have as many sessions with me as you’d like, without me locking you into some predefined number that says “this is how long it’s going to take”. You can meet with me as much or as little as you want. That being said, understand that noticeable change takes time and perseverance. We will need to meet more than a couple times in order for us to make true progress together. Depending on what we’re working on I like to see clients at least 10 times, however, this is not a rule. It’s all up to you.</p>\n","url":"/consulting","relative_path":"_projects/consulting.md","permalink":null}],"testimonials":[{"draft":false,"categories":[],"layout":"default","name":"Atif Aziz","position":"Principal Software Engineer at Microsoft","image":"images/atif.jpg","blurb":"Adrian does not shy away from challenges. I have seen tech professionals with years of industrial experience have trouble where he delivers with ease.","title":"1atif","slug":"1atif","ext":".md","tags":[],"excerpt":"\n","date":"2024-08-10 16:57:52 -0500","content":"\n","url":"/testimonials/1atif.html","relative_path":"_testimonials/1atif.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Haider Alleg","position":"Global Head of Digital at Ferring Pharmaceuticals","image":"images/haider.jpg","blurb":"Adrian can handle even the most challenging assignments with great success thanks to his distinct flair for organisation and planning.","title":"2haider","slug":"2haider","ext":".md","tags":[],"excerpt":"\n","date":"2024-08-10 16:57:52 -0500","content":"\n","url":"/testimonials/2haider.html","relative_path":"_testimonials/2haider.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Omid Shahmirzadi, PhD","position":"Quantitative Strategist at Millenium","image":"images/omid.jpg","blurb":"Adrian showcased a commendable work ethic and reliability. He efficiently used his skills in data science, data engineering, and software engineering to deliver valuable products of use to the team.","title":"3omid","slug":"3omid","ext":".md","tags":[],"excerpt":"\n","date":"2024-08-10 16:57:52 -0500","content":"\n","url":"/testimonials/3omid.html","relative_path":"_testimonials/3omid.md","permalink":null},{"draft":false,"categories":[],"layout":"default","name":"Cosmin Rusu","position":"Founder and Lead Software Engineer at Duty Ventures","image":"images/cosmin.jpg","blurb":"Adrian is organized, plans well and is a proactive communicator. His ability to take action make him a great entrepreneur.","title":"4cosmin","slug":"4cosmin","ext":".md","tags":[],"excerpt":"\n","date":"2024-08-10 16:57:52 -0500","content":"\n","url":"/testimonials/4cosmin.html","relative_path":"_testimonials/4cosmin.md","permalink":null}],"data":{"newsletter":{"newsletter_title":"Sign Up for Sparse and Relevant Emails","newsletter_description":"Get notifications when the Zoom group is meeting and when new offerings are rolled out","newsletter_identifier":"github.us22.list-manage.com/subscribe/post?u=8240d363380837e0f23341a1e&amp;id=5b3c01873d&amp;f_id=009ed2e1f0","newsletter_button":"Subscribe"},"navigation":{"menu-settings":{"menu-items":[{"title":"About","submenu":[{"url":"/about/","title":"About Me"},{"url":"/ethics/","title":"Ethics"}]},{"title":"Offerings","url":"/offerings/"},{"title":"Articles","url":"/blog/"},{"title":"Contact","url":"/contact"}]}},"general_settings":{"title":"Eleanor Rykener","description":"Eleanor Rykener - Disability Doula & Coach","disqus-identifier":null},"settings":{"title":"Rykener"},"author":{"author_name":"Rykener","author_image":"/images/rykener_joke.jpg"},"social_links":{"social":[{"icon":"Instagram","link":"https://instagram.com/lithium.diaries/"},{"icon":"Substack","link":"https://dearlithium.substack.com"}]},"footer":{"footer-menu-settings":{"menu-items":[{"title":"Home","url":"/"},{"title":"About","url":"/about/"},{"title":"Offerings","url":"/offerings/"},{"title":"Articles","url":"/blog/"},{"title":"Contact","url":"/contact"}]},"copyright_text_html":"<p>&copy;2024 <a href=\"/\">Rykener</a> All Rights Reserved.</p>"}},"baseurl":null,"title":"Adrian Guerra"}}